[
    {
        "title": "Could Deuba’s displeasure slow the Congress poll march?",
        "tag": "Politics",
        "content": "Under newly elected party president Gagan Thapa, the Nepali Congress entered the election race with renewed energy and confidence. Several leaders close to former party president Sher Bahadur Deuba and senior leader Shekhar Koirala, who strongly opposed the special convention, are contesting the March 5 elections.\nHowever, the absence of several influential leaders, both as candidates and in the electioneering, could impact the party’s electoral showing, party leaders and cadres say.\nSeveral influential leaders who won the previous elections have been denied tickets, including vice-presidents Purna Bahadur Khadka and Dhan Raj Gurung, former general secretaries Prakash Man Singh and Shasanka Koirala, and leaders such as Ramesh Lekhak and Ramhari Khatiwada.\nLeaders close to Thapa are concerned that staunch opponents of the convention could resort to non-cooperation during the polls.\n“Some leaders close to Deuba who vehemently stood against both the regular and special general convention are not positive towards the new leadership,” a leader close to Thapa said on the condition of anonymity. “We fear there could be non-cooperation from their side, which will affect the election results.”\nAmid a prolonged dispute and intense internal power struggles, the Congress held its second special general convention in mid-January. Itelected Thapaas party president and formed a new central working committee under his leadership. However, the Deuba camp refused to accept the convention’s process or its outcome.\nAs a result, the legitimacy of the second special general convention was first challenged at the Election Commission and later taken to the Supreme Court. The commissionupheld the convention, citing the participation of more than 56 percent of the general convention delegates. The court also didn’t immediatelyoverturn that decision, though a writ petition lodged by those close to Deuba is still sub judice.\nThe fear of non-cooperation by the dissident faction is not limited to leaders close to Thapa. It has trickled down to the grassroots. Anuj Regmi of West Nawalparasi is among those spooked.\n“If leaders like Deuba in Dadeldhura, former vice-president Khadka in Surkhet, or Singh in Kathmandu do not actively support the party during the election, it will inevitably hurt us,” Regmi said at an event held in the Capital on Monday. “If leaders like Deuba, who had won past elections from their strongholds, remain silent, the election results will not be in our favour.”\nBut Devi Prasad Acharya, a party activist from Morang-2, believes the leadership change ahead of the House of Representatives election, which came on the back of the Gen Z uprising, will benefit the party despite the absence of some leaders.\nTop leaders from Thapa’s team are also hopeful the Deuba camp will support the party.\n“Though some of the party leaders are not actively participating in the election, we believe they would not refuse to support the party during the election,” said party General Secretary Gururaj Ghimire.\nAddressing an event in Janakpur on January 30, Thapa said he remains in constant touch with senior leaders, including Deuba.\n“I am in regular communication with our former party president, the respected leader Sher Bahadur Deuba, as well as other senior leaders,” Thapa said. “I urge everyone not to hold on to past grievances or misunderstandings.”\nPuranjan Acharya, a political analyst close to the Congress who is currently touring several districts of Koshi Province, said he has seen many senior party workers become inactive. Analysing the reasons behind this, Acharya notes that while the party did not formally split after the special convention, it has endured some damage as leaders who have long shaped the party’s identity have stayed inactive during the election period.\n“The impact of that is now being felt at the district level,” Acharya told the Post.\nHowever, some Congress leaders argue that the claim of non-cooperation doesn’t apply to every leader. Ramhari Khatiwada of Okhaldhunga is among the leaders who initially received a party ticket but was denied later. Khatiwada said he will do everything possible to strengthen the party, even though he didn’t get a ticket.\nKhatiwada added that the country is going through a difficult phase and questions about who got a ticket and who did not can be assessed after the election. “This is the moment to support the party and its candidates,” he said. “I will extend that support from my side.”",
        "url": "https://kathmandupost.com/politics/2026/02/03/could-deuba-s-displeasure-slow-the-congress-poll-march",
        "scraped_at": "2026-02-03T19:20:36.657896"
    },
    {
        "title": "Nepal, India explore interbank channel for large Indian currency transfers",
        "tag": "Money",
        "content": "The central banks of Nepal and India are exploring the possibility of using the interbank market—one of the most important segments of the foreign exchange system—to allow the transfer of Indian currency between banks in the two countries in large volumes.\nAlthough Nepal formally allowed the circulation of Indian currency notes above INR100 up to a limit of INR 25,000 per person by publishing a notice in the Nepal Gazette on January 12, Nepal Rastra Bank (NRB), the country’s central bank, has yet to issue a circular implementing the provision for banks and financial institutions.\nGuru Prasad Paudel, spokesperson for Nepal Rastra Bank, said that NRB and the Reserve Bank of India (RBI), the central bank of India, are in discussions to allow Indian currency to be transferred in any amount through the banking systems of the two countries.\nNepal’s central bank awaits formal response from the Indian central bank after the latter committed to simplifying the process.\n“This will be a big breakthrough,” Paudel said. “It will ensure that deposits of Indian currency do not create a burden on Nepal’s banks, while Nepali banks will be able to get Indian currency in any amount through digital transactions.”\nHe said the arrangement would also ensure that Indian currency deposited in Nepali banks—regardless of volume—can be transferred to Indian banks. Likewise, Nepali banks would be able to receive Indian currency in any amount from Indian banks upon request.\nThe move is significant for Nepal, particularly in light of the estimated INR50 million worth of Indian currency that remains stacked at Nepal Rastra Bank after India refused to exchange the notes following its demonetisation drive.\nOfficials say the proposed interbank transfer facility would ensure that even if large volumes of Indian currency accumulate within the Nepali banking system, it would not disrupt financial stability as banks would have a mechanism to move the funds across the border.\nOn November 8, 2016, the Indian government demonetised INR500 and INR1,000 notes, citing the need to “unearth unaccounted wealth and fight corruption.” The demonetised notes were later replaced with new INR 2,000 notes.\nFollowing India’s move, Nepal’s Cabinet decided on December 13, 2018 to ban Indian currency notes above INR100. Nepal Rastra Bank subsequently issued a circular on January 20, 2019 prohibiting Nepali travellers, banks and financial institutions from holding or transacting in such notes.\nPaudel said NRB has kept on hold the issuance of a new circular allowing banks and financial institutions to handle Indian currency above INR100, even though the provision was published in the Nepal Gazette three weeks ago.\n“As soon as the central banks of both countries agree on the fund transfer mechanism, we will issue the circulars,” he said.\nDespite the absence of a circular for banks, individuals are legally allowed to carry Indian currency within the limits prescribed by law, and there is no blanket restriction on possession by the public, he said.\nIndia’s central bank amended its Foreign Exchange Management (Export and Import of Currency) Regulations on November 28 last year, with the changes published in India’s official gazette on December 2.\nAccording to the amended regulations, individuals may take Indian currency notes of any amount in denominations up to INR100 to Nepal and bring them back to India. In addition, they may carry notes of denominations above INR100 up to a total value of INR 25,000 per person in either direction.\nNepal, for its part, allows tourists—including Indian nationals—to bring in up to US$5,000 or its equivalent in other convertible currencies without declaration. Amounts above that threshold must be declared at customs, and visitors are not allowed to take more than $5,000 out of Nepal.\nAccording to the Nepal Gazette, Nepali and Indian citizens may carry or send from Nepal to India an unlimited amount of Nepali and Indian coin currency and banknotes, except Nepali coins made of gold, silver or mixed silver. This effectively means that Nepali and Indian citizens may carry or send unlimited amounts of Indian currency in denominations below INR100.\nHowever, no person is allowed to export or import foreign currency or Nepali currency beyond the prescribed limit without prior approval, except in cases permitted by prevailing laws and regulations.\nForeign nationals entering Nepal may bring foreign currency as allowed under existing rules. When leaving the country, they may take out only the amount declared at entry or legally exchanged within Nepal, subject to verification.\nAny person importing currency above the prescribed limit must truthfully declare the amount at customs checkpoints. Failure to declare, false declaration, or carrying currency beyond the permitted threshold is considered an offense under prevailing law, and such currency is subject to confiscation along with other legal penalties.\nThe law also clearly states that no person is allowed to transact in Indian currency notes of denominations of INR500 and INR1,000 that were in circulation prior to November 9, 2016.\nIndian currency notes of denominations of INR200 and INR500 that have been issued and are in circulation since November 9, 2016 may, however, be brought into Nepal from India or taken from Nepal to India by Nepali or Indian citizens, subject to a ceiling of INR25,000 per person.",
        "url": "https://kathmandupost.com/money/2026/02/03/nepal-india-explore-interbank-channel-for-large-indian-currency-transfers",
        "scraped_at": "2026-02-03T19:20:37.284506"
    },
    {
        "title": "Outpatient coverage drastically slashed under government’s health insurance",
        "tag": "Health",
        "content": "The expense ceiling under the government’s health insurance scheme has been significantly reduced in a measure aimed at curbing the ongoing financial crisis faced by the Health Insurance Board.\nAs per the Board’s new decision, outpatient services will be covered only up to Rs25,000 per patient or the same amount may be used collectively by up to four members of an insured family. Previously, patients could access services worth up to Rs100,000, covering outpatient, inpatient, and emergency care.\n“This is a short-term measure the board is taking for the continuation of the scheme and to address the ongoing financial crisis faced by the board,” said Bikesh Malla, information officer at the board. “The new decision will take effect from February 13.”\nOfficials say the new decision to lower the ceiling for outpatient care is in line with an expert panel's recommendation.\nThey say that the new ceiling has been set only for outpatient care, and patients requiring inpatient or emergency treatment will still receive coverage up to Rs100,000.\n“Overall, 71 percent of the total existing expenses are from outpatient care,” said Malla. “Due to a lack of ceiling of service in outpatient care, our expenses increased alarmingly. Without reducing costs, the board is no longer in a position to continue the service.”\nSome hospitals, including the Tribhuvan University Teaching Hospital, have stopped providing services under the government’s health insurance scheme since January 15. Several others have warned that they will be forced to stop services if long overdue payments are not reimbursed immediately.\nEvery day, hundreds of patients who arrive at the hospital for treatment with a health insurance card either return without receiving care or are required to pay hospital charges, just like patients without insurance coverage.\nThe TU Teaching Hospital administration cited overdue payments of around Rs400 million, rejected claims, and low service rates as major issues. According to officials, around 50 percent of the hospital’s claims were not approved by the board, so the hospital lost over Rs20 million every month.\nOfficials at the board said all government funds allocated for health insurance and premiums collected from the public have already been paid to health facilities. Altogether, Rs14 billion had been paid by December. This included Rs11 billion from the Ministry of Health and over Rs3 billion collected in premiums from the public.\nThe board needs to pay an additional Rs 10.5 billion in dues to over 500 health facilities, including the TU Teaching Hospital. Officials said this shortfall is due to a funding crunch, not intentional delays. On average, about 50,000 people use services each day, and over 10 million people are covered by health insurance.\nOfficials say the Ministry of Health and Population has also asked the board to limit expenses to around Rs14 billion, and the new decision to set a ceiling in the outpatient care is in line with the ministry’s direction.\nThey also said the Social Security Fund provides outpatient coverage of only Rs 25,000 and hope that the board’s decision will not have a serious impact on patient care.\nExperts however, say the decision to limit outpatient care contradicts the health insurance policy and could affect policy renewal.\n“People are told that they will be provided coverage up to Rs100,000 when they buy the policy,” said Dr Senendra Upreti, former health secretary and also former director of the Board. “People may not renew their policies, if the outpatient coverage is reduced.”\nUnder the original scheme, a family of up to five members pays Rs3,500 for treatment, including medicines, check-ups, and counselling. One family member can use the insurance coverage worth Rs100,000 per year, or the amount can be divided among five members. Families with more than five members pay Rs700 per additional member for an extra Rs20,000 in health insurance coverage.\nPeople covered by the insurance can access healthcare services at designated facilities by presenting their identity cards. Expenses incurred by health facilities are reimbursed by the Health Insurance Board.\nFor patients of chronic diseases, the government provides Rs200,000 in insurance coverage, and as of this fiscal year, the board has paid over Rs50 million, officials said.\nThe government also covers premiums for certain groups—those living below the poverty line in 26 districts, those above 70 years, family members of people living with HIV, disabled people, and those suffering from leprosy and multi-drug resistant tuberculosis.\nCurrently, the government pays the insurance premiums for around 55 percent of people enrolled in the scheme.",
        "url": "https://kathmandupost.com/health/2026/02/02/outpatient-coverage-drastically-slashed-under-government-s-health-insurance",
        "scraped_at": "2026-02-03T19:20:37.674775"
    },
    {
        "title": "Government warns against submitting fake information for visas",
        "tag": "National",
        "content": "The government has cautioned all citizens to submit official documents containing accurate information when applying for visas to enter foreign countries, particularly the United States.\nThe Ministry of Foreign Affairs and four US-based Nepali missions issued simultaneous cautionary statements after finding that some visa applicants’ documents were under scrutiny.\n“Some affidavits and documents submitted by Nepali visa applicants have faced scrutiny,” said Lok Bahadur Paudel Chhetri, the spokesperson at the foreign ministry, explaining the reasons for issuing the statements.\nOfficials at the ministry and Nepali missions in the United States said the US raised concerns regarding the character certificates issued by the Nepal Police. Following this, various government agencies stepped in to issue cautionary statements.\nAlong with the foreign ministry and Nepali diplomatic missions, the Ministry of Home Affairs said it is mandatory to provide official documents and accurate information during the application process.\nIf the submitted information or documents are found to be false or misleading, not only may the visa be rejected, but the applicant may also be prohibited from visiting that country in the future, it said.\n“In addition, as Nepali law considers such acts to be criminal offences, further investigation and legal action may also be taken. Therefore, applicants are requested to submit only duly obtained official documents to the concerned authorities, without being influenced by intermediaries or consultants,” said the ministry’s notice.\nAll information related to the visa applications and required documents is available on the websites of the respective embassies and consulates, the notice said.\n“You can apply for a visa on your own without the assistance of a visa consultant. Even when using the services of a visa consultant, the final responsibility for verifying the authenticity and accuracy of all submitted documents and information lies with the applicant.\n“If the submitted documents are found to be false or misleading, the visa may be canceled, future travel may be restricted, and legal penalties may be imposed, therefore, please exercise caution when using the services of a visa consultant,” reads the statement.\nThe warning comes after the recent US immigration rule under the Trump administration, which suspended processing of immigrant visas for applicants from 75 countries, including Nepal, from January 21.\nUnder the new rule, the US Department of State paused all immigrant visa issuance to nationals of countries (including Nepal) whose immigrants have a high rate of collecting public assistance at the expense of US taxpayers.\nLast week, the Nepali Embassy in Washington DC and three other Nepali Missions in the US also issued similar statements and cautioned Nepali citizens about the new US rules, including overstay and related burden on US state coffers.\n“We have advised our citizens not to become a burden by claiming additional services such as education, food, health and other public benefits. We have also urged them not to obtain fake documents to secure a US visa as this can cause serious trouble if discovered,” the official added.\nAccording to the US Embassy in Kathmandu, starting January 21, Nepali nationals eligible for a B1/B2 visa must post a bond of up to $15,000.\n“At the time of the interview, the consular officer will inform the applicant whether they are eligible for a visa and will provide instructions on how to pay the bond,” said the official.\nOn Friday, the Nepali embassy in Washington, DC, warned Nepali nationals residing in the US that misuse of government-supported benefits or violations of visa conditions could result in the revocation of visas or permanent resident status.\nLikewise, the US Embassy, Kathmandu, has also expressed concern over the quality of the police report being issued by the Nepal Police.\nIn a recent meeting with Home Minister Om Prakash Aryal, Scott Urbom, the chargé d’affaires of the US Embassy in Kathmandu also complained about flaws in police reports, according to officials at the Home and Foreign Ministries. “The US side stated that the character certificate that Nepal Police issues should follow the pre-2023 format. Many individuals who were given cleanchit by the police were found to have criminal records or became involved in crime in the US. Even minor offences must be reported,” the official familiar with US concerns told the Post.\nAddressing these concerns, the Home Ministry on Friday issued a statement, mentioning that the government follows the National Criminal Record Management and Police Character Certificate Distribution Directive-2020.\n“The directive specifies the responsibility, procedures, and criteria for issuing police character certificates. It also includes provisions on whether or not such certificates may be issued, online-based distribution, correction of errors, prevention of tampering or forgery, verification mechanisms, and integration with the National Identity Management Information System.”\nAccording to the directive,character certificates based on false information, or that are forged, altered, or tampered with, will result in action under prevailing laws, said the statement. Additionally, as per Section 25 of the National Penal Code, 2017, offenses related to such acts are punishable under the law.\nThe US Embassy did not respond to a query by the Post regarding US concerns about the police report.",
        "url": "https://kathmandupost.com/national/2026/02/02/government-warns-against-submitting-fake-information-for-visas",
        "scraped_at": "2026-02-03T19:20:38.233992"
    }
]