[
    {
        "title": "137 crocodiles released in Rapti river",
        "content": "Chitwan, February 3\nOne hundred thirty-seven crocodiles, raised at the Crocodile Breeding Centre of Chitwan National Park, have been released in their natural habitat. With the release of 20 crocodiles in the Rapti River on Monday last time, the number of crocodiles released in the  Rapti River has reached 137 so far in the current fiscal year.\nAll the crocodiles were released in the Rapti River, said Information Officer of CNP, Abinash Thapa. All 137 crocodiles released in the Rapti River are female, he added. Crocodiles raised in the breeding centre are released in natural habitat. A total of 2,207 crocodiles brought up in the breeding centre have been released in rivers so far, mentioned Thapa. There are now 630 crocodiles in the breeding centre.",
        "url": "https://english.onlinekhabar.com/137-crocodiles-released-in-rapti-river.html",
        "scraped_at": "2026-02-03T19:15:13.337110"
    },
    {
        "title": "Healing in silence through Vipassana after the Gen Z uprising",
        "content": "My WhatsApp was still beaming with notifications as I prepared to switch it off for twelve days. I could not remember the last time I had stayed away from this device for even a full day, let alone nearly two weeks. As I walked toward the residential quarters, something unfamiliar settled in relief. Finally, I was here.\nVipassanais one of the oldest meditation techniques in the world, tracing back more than 2,500 years to Gautama Buddha. It is not prayer, nor is it philosophy in the conventional sense. It is a disciplined practice of observing reality as it is, through sustained attention to bodily sensations, without reaction, without judgment. The idea is deceptively simple: observe impermanence, and suffering loosens its grip. Across the world, Vipassana centres host ten- to twelve-day residential courses where participants live in complete silence, cut off from phones, books, writing materials, and even eye contact. What sounds serene in theory is, in practice, deeply exacting.\nFor me, this retreat was not spiritual tourism. It was a temporary escape, an intentional pause. From the image that had been built around me over the past three months, from relentless responsibilities, from noise and scrutiny. From chaos to absolute silence. Nestled within the thick green embrace of Shivapuri National Park, the centre was surrounded by forest on three sides. Inside, people of different ages and nationalities gathered. We carried different stories and wounds, but in the cold of January, we arrived united by a common hunger: peace.\nSeveral people had warned me against going, “Amy, not now.” These were not casual opinions; they came from well-wishers who had Vipassana experience and had also witnessed my emotional state after September 8. Every human copes differently. Some process pain outwardly and recover. Others fracture quietly and mask the cracks with productivity. I belonged to the second category. In my determination to move on, I had become hyper-functional, working relentlessly, filling every silence with labour, leaving no room to breathe. I knew it, yet I kept going.\nSome experiences do not merely hurt; they dismantle you from the inside. After theGen Z revolution, despite being relatively withdrawn from media, I found myself pulled into attention I had not sought. It began gently, messages of pride, curiosity, encouragement. But gradually, the tone shifted. Hate messages and threats began to appear. Many came from strangers, and some also from people I knew. I had always believed I had thick skin, that I could handle public pressure. But this time, it pierced through; it had crossed a line. It hurt. It frightened me.\nAlongside social duty, I was also carrying personal responsibilities and navigating the moral weight of public mandates. I chose this path consciously, and I stand by that choice. But in choosing everything else, I forgot to choose myself. I ignored the anxiety. I ignored the way echoes of violence followed me into sleep. I convinced myself that if I worked harder, if I stayed busy enough, it would disappear. Instead, the pressure intensified. The threats amplified what I was already suppressing.\nSome of my closest ones noticed the cracks before I admitted them to myself. They suggested counselling. They suggested rest. I dismissed it all until one day, the weight became unbearable. Then I realised I needed a break. Not an escape filled with distraction, but a space where I could hear myself again. I wanted to sit with myself, uninterrupted. That craving led me to Vipassana.\nEven the centre advised me to wait. During the initial call, I was warned that this might not be the right moment emotionally. I insisted. I was certain I needed this. Eventually, they agreed. And so, on January 1, the journey began.\nThe silence, when it first descended, felt almost luxurious. No small talk. No notifications. No performance. But silence is not passive, it is confrontational. As the days progressed, everything I had been running from rose to the surface. Unfinished emotions. Suppressed fear. Scenes I had avoided replaying. Those warnings suddenly made sense. The first few days were not peaceful; they were punishing.\nThe discipline was uncompromising. Waking up at 4 a.m. in freezing temperatures. Long hours of meditation, often more than twelve hours a day, sitting cross-legged on the floor, back straight, eyes closed. No speaking. No gestures. No eye contact. Meals were simple, vegetarian, and timed. Sleep was limited. The body protested constantly. Legs went numb. The mind rebelled. There were moments when quitting felt tempting.\nAnd yet, the surroundings were breathtaking. The stillness of the forest. The crisp air. The paradox of being surrounded by people while living in complete solitude. One could dismiss it as escapism, but I realised how rare it is to allow yourself such deliberate withdrawal. Sometimes, healing requires a kind of selfishness, the kind that saves you before you are completely eroded.\nTime behaved differently inside the centre. Days blurred. Clocks lost relevance. Over twelve days, I learnt patience not as an idea but as endurance. I met myself without distractions. I confronted emotions that demanded acknowledgement. I cried without witnesses. I watched my reactions rise and fall. Slowly, painfully, I began to let go.\nOne of the most profound aspects of Vipassana is its refusal to offer emotional shortcuts. There is no reassurance, no affirmation, no external comfort. You are taught to observe, not suppress, not indulge. In that observation, something shifts. I forgave myself. I forgave others, not to absolve, but to release myself from carrying the weight. I encountered spirituality stripped of labels, religion not as identity, but as lived ethics and awareness.\nWhen silence was finally broken on the last day, I was surprised by my own restraint. I did not feel euphoric. I felt grounded. When I walked out of the centre on day twelve, I carried peace, quiet, stable peace.\nI will not romanticise this experience. Vipassana is not a miracle cure. It does not transform you overnight or erase trauma. What it does is force you to face yourself, your demons, your fears, your past, your uncertainties about the future. It is a journey inward, filled with smooth stretches and deeply uncomfortable terrain. But if you complete it, you return with clarity.\nI found uninterrupted sleep. I found stillness after months of inner noise. Most importantly, I released an emotional burden I had been carrying silently. I walked out lighter, with gratitude rather than exhaustion. For now, for me, that is more than enough.\nDo I recommend Vipassana? Yes and no.\nI am sharing this not to persuade, but to bear witness. If this account inspires you, let that inspiration mature before acting. Vipassana is not something to be done casually. The decision must come from within, and you must be very certain. This journey within your own universe is not a cakewalk. So, while the end carries peace, the beginning demands huge courage.",
        "url": "https://english.onlinekhabar.com/vipassana-after-the-gen-z-uprising.html",
        "scraped_at": "2026-02-03T19:15:16.893409"
    },
    {
        "title": "Voting allowed by showing any one of 6 types of government documents",
        "content": "Kathmandu, February 3\nThe Election Commission has stated that voters will be allowed to cast their ballots by presenting any one of six types of government-issued documents.\nThis was stated in a response to a query received by the call centre established by the Election Commission. In response to the question of whether voting is allowed without a voter ID card, the Commission said that voting is permitted if a voter can present any one of six government documents.\nAccording to the Commission, being registered in the voters’ list is mandatory in order to vote. Voters whose names are included in the voters’ roll are generally required to carry their voter ID card when they go to vote.\nIn the absence of a voter ID card, or if it has been lost or damaged, voters may cast their ballots by presenting the original copy of any one of the following documents: a Nepali citizenship certificate, national identity card, passport, driving licence, or land ownership certificate.\nThe election is scheduled to be held on Falgun 21.",
        "url": "https://english.onlinekhabar.com/voting-allowed-by-showing-any-one-of-6-types-of-government-documents.html",
        "scraped_at": "2026-02-03T19:15:21.822581"
    },
    {
        "title": "Threads of Joy celebrates Nepali pashmina at EU-hosted fashion event",
        "content": "Kathmandu, February 3\nOn Saturday, theEuropean Union Delegation to Nepalhosted the “Threads of Joy” fashion showcase, celebrating the artistry of Nepali chyangra pashmina garments alongside creative designs from Chula, a Spanish fashion brand. The event also featured a vibrant pop-up market where guests could explore and purchase a wide array of goods, all at the premises of EU Ambassador Veronique Lorenzo’s residence in Kathmandu.\nThe event opened with dresses byChula, a fashion brand founded in 2004 by Spanish designer Laura Fontan and her late husband Diego Cortizas. Produced in Vietnam, Chula works with social enterprises to provide opportunities for individuals with disabilities.\nModels also presented pashmina ensembles characterised by muted natural tones of brown and white, each crafted with care from handspun pashmina sourced from chyangra goats from the remote Himalayan regions of Mustang and Dolpa. The collection, curated by talented stylist Deepa Kunwar, showcased offerings from KPA Cashmere, Cashmere World Nepal, and Nepal Fibre Processing Pvt. Ltd., the nation’s first specialised facility dedicated to refining Chyangra fibre.\nThe event brought together a diverse gathering of diplomats, cultural leaders, fashion professionals, artisans, and friends of Nepal and the EU. It also featured a pashmina processing demonstration by the Nepal Pashmina Industries Association and showcased products from HerCraft Nepal, a women-led social enterprise supported by Action Nepal that specialises in home décor and accessories. Amresh Shah, a former member of the EU Youth Sounding Board, also offered Madhubani spice blend made by his family members.\nThe European Union has consistently championed Nepal’s pashmina industry, facilitating its growth through the EU Trade Investment Programme from 2020 to 2024, which established a robust supply chain from fibre collection to global export. With the continued support of the United Kingdom Trade Partnership Programme and implementation by the International Trade Centre, the industry has undergone a remarkable transformation. Women artisans now enjoy greater access to training, fair wages, and international markets, leading to a significant increase in exports.",
        "url": "https://english.onlinekhabar.com/threads-of-joy-eu-fashion-event.html",
        "scraped_at": "2026-02-03T19:15:31.424809"
    },
    {
        "title": "Oil Corporation: No gas shortage in the market; additional 2,000 ton quota set for February",
        "content": "Kathmandu, February 3\nThe Nepal Oil Corporation (NOC) has stated that it has taken note of public complaints regarding an alleged shortage of cooking LPG gas in Kathmandu Valley and other parts of the country.\nIssuing a press release on Monday, the corporation clarified that there is no shortage of gas in the market and that the supply system is fully smooth.\nThe clarification comes after reports and public complaints about a gas shortage circulated in various media outlets and on social media over the past few days.\nThe corporation said that sufficient fuel is being imported to meet the high demand during the winter season. It stated that while a monthly quota of 49,500 tonnes of gas has been fixed for industries nationwide, 47,264 tonnes were imported and distributed in November 2025, 48,531 tonnes in December 2025 and 47,304 tonnes in January 2026.\nAccording to the corporation, these quantities are sufficient to meet winter demand.\nAcknowledging that minor issues have been seen in cylinders of a few limited gas industries, the corporation said it has already directed those industries to immediately streamline supplies and normalise the market.\nIt assured that the problem, caused by managerial issues in some industries, will be resolved soon and that all brands of gas will be readily available in the market. The corporation added that effective measures are being taken to address minor supply imbalances.\nThe corporation has also made additional preparations for February. “Considering the upcoming election and current demand, the corporation has decided to add 2,000 tonnes of gas to the regular quota for February,” the statement said. “For this purpose, ‘bottlers-wise allocation’ has already been sent for imports from various refineries and bottling plants of Indian Oil Corporation.”\nThe corporation has urged consumers not to create artificial shortages and to avoid unnecessary stockpiling of gas.\n",
        "url": "https://english.onlinekhabar.com/oil-corporation-no-gas-shortage-in-the-market-additional-2000-ton-quota-set-for-february.html",
        "scraped_at": "2026-02-03T19:15:37.899238"
    },
    {
        "title": "Nepal’s election campaign gains pace but manifestos remain absent",
        "content": "As the House of Representatives election scheduled for March 5 draws closer, candidates have already begun campaigning. They are meeting voters and conducting door-to-door outreach in their constituencies to seek public support. On digital platforms, too, candidates have been strengthening their presence with the same aim.\nOne critical element, however, is missing: none of the political parties has released a manifesto. A manifesto is among the most important tools in an election, offering voters a clear basis on which to judge candidates and parties. Yet parties appear to be avoiding this essential responsibility.\nAs of this writing, just 36 days remain until the election, but no party has published its manifesto. Candidates are therefore campaigning without clearly articulating their policy priorities or governing vision.\nThe election date was announced six months ago, following the formation of an interim government under Prime Minister Sushila Karki after the Gen Z–led protests of September 8 and 9. Political parties had ample time to prepare and present their manifestos. Their failure to do so has prompted growing public concern.\nPolitical analyst Saugat Gautam says that because all major parties have already selected their prime ministerial candidates, many contenders are focused more on promoting those figures than on communicating their own plans and agendas. As a result, he says, the campaign has become increasingly centred on individuals rather than policies.\n“The sooner the manifesto is published, the better,” Gautam says toOnlinekhabar. “If there is a delay, people will have less time to critically assess it.”\nConcerns over the delay have also been voiced on social media. Rakshya Bam, a Gen Z activist, has publicly urged parties to release their manifestos as soon as possible.\n“We want to read your manifesto,” shewrites. “The public will vote based on the plans and agendas you intend to implement after becoming parliamentarians. Be accountable to the people and publish your manifesto.”\nOnline criticism has continued to grow, though political parties appear largely unresponsive. Writer Srijana Pokhrelnotedin a recent social media post that more than a dozen candidates contesting the election are her Facebook friends, representing different parties. She said she reviewed each of their profiles but did not find a single candidate who had pinned their party’s manifesto.\nPokhrel also criticised candidates who ask voters to judge them by their records, arguing that such records are often “disgraceful.” At the same time, she questioned candidates with no political track record, asking whether they expect voters to support them based solely on an introductory video. “This is an election, not a beauty pageant,” she wrote.\nThe Nepali Congress, for its part, says it is still in the preliminary phase of drafting its manifesto.\n“We are still at an initial stage and are consulting experts from different sectors,” says Pratap Paudel, political adviser to Gagan Thapa, the party’s president.\nPaudel says the manifesto had not been delayed, adding that election-related activities already underway may have created the perception that its release was overdue. “In fact, manifestos are usually announced only about a month before the election,” he said. He added that Thapa is currently campaigning in Sarlahi and that a party meeting will decide the date of publication after his return.\nThapa is leading the manifesto drafting process for the Nepali Congress.\nUnlike the Nepali Congress, the CPN-UML says it is in the final stage of preparing its manifesto.\n“We are almost ready to publish it,” says Min Bahadur Shahi, head of the party’s publicity department.\nShahi said a few issues still required internal discussion before the manifesto could be released.\n“We are trying to publish it as soon as possible,” he added.\nThe Rastriya Swatantra Party has informed that it plans to release its manifesto on February 13.\n“We are reviewing the draft and compiling suggestions and findings from provincial consultations and field studies,” says Manish Jha, the party’s spokesman.\nThe manifesto is being drafted under the leadership of Swarnim Wagle, the party’s vice chairman. Jha said that because candidate nominations were filed 45 days ahead of the election, compared with 17 days in previous cycles, many people felt the manifesto announcement was overdue.\nKrantishikha Dhital, a central committee member of RSP actively involved in drafting the manifesto, said the party would release practical and achievable pledges rather than grand, unrealistic promises.\n“We are not preparing impossible or irresponsible declarations. The manifesto is being drafted in a way that directly addresses the concerns of young people,” says Dhital. “We will come forward soon with proposals that reflect the public’s expectations. Our focus will be on education, health care, employment and capital formation.”\nWith just over five weeks remaining before voters go to the polls, the absence of manifestos has left many unsure how to compare candidates beyond personalities and past affiliations, raising broader questions about accountability and policy-driven debate in the campaign’s final stretch.\nParty leaders also acknowledge that delays in releasing the manifesto could make it more difficult for voters to compare candidates.",
        "url": "https://english.onlinekhabar.com/nepals-election-manifestos-absent.html",
        "scraped_at": "2026-02-03T19:15:41.487646"
    },
    {
        "title": "Meet Sharda Kumari Paudel, first female principal of Nepal’s oldest school",
        "content": "Following an intensely complex political period, Nepal this year appointed its first woman prime minister, a historic milestone. While the appointment of Sushila Karki as the country’s first female prime minister has drawn global attention, another appointment within Nepal has received far less discussion despite its significance.Durbar High School, also known as Bhanu Secondary School, the first school in Nepal, has appointed its first female principal, 172 years after its establishment.\nOn November 20, Sharda Kumari Paudel was appointed principal of Durbar High School. Previously, she had been serving as the school’s acting principal.\nBeing promoted from acting principal to principal, Paudel says she now feels more confident, responsible, and challenged.\nShe was appointed through an open competition among three contenders, in which she was the only female candidate.\nEstablished in 1854, Durbar High School took a long time to appoint a female principal. In this context, Paudel notes that in the past, women rarely entered the teaching profession, and those who did were mostly limited to teaching at the primary level.\n“Women in the past were confined to family life due to societal structures, which limited the time they could devote to their professional development,” says Paudel. “As a result, it took a long time for women in almost every sector to reach higher positions, and Durbar High School is no exception.”\nHowever, Paudel considers herself fortunate, as it was her father who inspired her to become a teacher and pursue a career in the profession.\n“My father always motivated me to serve society, and as a result, I chose to become a teacher,” she says.\nBorn in Syangja in western Nepal, Paudel joined the teaching profession in 2004. Her first posting was at Mahendra Rastriya Secondary School in Baluwatar, where she taught health education for 10 years. In 2014, she joined Durbar High School as a permanent secondary-level teacher, teaching economics.\nIn 2019, she was appointed assistant principal of the school. At that time, Durbar High School had only 71 students. In 2020, at the height of the COVID-19 pandemic, she was appointed principal with limited responsibilities. Under her leadership, the school began conducting virtual classes. Despite the challenges, the school also focused on strengthening extracurricular activities. It organised a national essay competition on the impact of COVID-19 and established a robotics lab.\nDurbar High School became the first government school in Nepal to introduce robotics classes. Students from the robotics program went on to win several competitions and participate in international events outside Nepal. Meanwhile, the school, severely damaged by the devastating 2015 earthquake, completed its renovation. In collaboration with Kathmandu Metropolitan City, smart boards were also installed in classrooms. After physical classes resumed, the number of students increased to 350.\nAs the quality of education improved, Durbar High School began attracting public attention. Even parents who had been sending their children to private schools started enrolling them at Durbar High School, one of the rarest shifts seen in Nepal’s education sector.\nSimilarly, under Paudel’s leadership, the school’s canteen and security systems improved. Currently, the school has 1,095 students. Managing such a large number of students has become one of Paudel’s major challenges as principal.\nThe challenge is compounded by the fact that Sanskrit Secondary School, which has around 900 students, is also operating within the Durbar High School building.\n“As two different institutions run in the same building, conflicts sometimes arise among students and teachers, and in such cases I have to be especially sensitive,” says Paudel.\nDue to overcrowding, the school is compelled to run tiffin breaks multiple times, which often causes disturbances. Efforts are underway to address this challenge, she adds.\nWhile the number of students continues to grow each year, the school’s resources remain limited. However, with support from guardians, the school has managed to recruit additional staff.\nTo prevent a shortage of teachers, the school has recently introduced the concept of a “Teachers Bank.” The Teachers Bank serves as a backup pool of teachers. For instance, if a teacher is unable to attend classes for a week or longer, the school can reach out to teachers listed in the Teachers Bank. The school has also publicly advertised this initiative and invited interested individuals to join. As a result, Paudel has received many inquiries and has been personally handling the process.\nPaudel’s tenure as principal will be four years. Speaking toOnlinekhabar, she shared the plans she hopes to accomplish during her term.\nHer priority is to strengthen the school’s technological capacity so that students become more technologically skilled. Second, she plans to introduce more optional subjects. She also aims to prioritise sports. Lastly, she intends to improve students’ public speaking skills and further enhance the quality of the robotics program.\n“My goal is to make Durbar High School a place where students are confident, skilled, and ready to compete anywhere, not just in exams, but in life,” says Paudel.",
        "url": "https://english.onlinekhabar.com/principal-sharada-kumari-paudel.html",
        "scraped_at": "2026-02-03T19:15:45.133774"
    },
    {
        "title": "Fearless and unbound Nepali youth make historic wheelchair bungee jump",
        "content": "Dilip Sapkota of Chautara Sangachokgadhi Municipality–5, Sindhupalchok and Shishir Dahal of Kamalamai–5, Sindhuli, completed a wheelchair bungee jump from the suspension bridge over the Bhotekoshi River in Sindhupalchok.\nThey claim this bungee jump, said to be the first of its kind in Nepal, is historic. Sapkota asserts that he is the first person in Nepal’s history to do a bungee jump in a wheelchair.\nAmong the two, Sapkota jumped first from the 160-meter-high suspension bridge, and Dahal successfully followed soon after.\n“It was a historic leap, for the first time in Nepal, I did a bungee jump from a wheelchair,” Sapkota says with excitement. “These activities are not just displays of personal courage. I want accessible tourism to grow in Nepal, and I want people with disabilities to participate equally in hiking, trekking, and adventure activities. That’s why I keep taking part in new and challenging adventures, hoping my experience will inspire confidence, motivation, and courage in others with disabilities.”\nDahal shares a similar experience. He toldOnlinekhabarthat the bungee jump was an enjoyable and memorable experience.\n“I wanted to experience it for myself. But I also wanted my attempt to inspire others, which is why I jumped along with my wheelchair,” Dahal says. “The bridge shook slightly, but the moment above the river,  being the first to bungee in a wheelchair was unforgettable.”\nShishir added, “I had done such adventure activities before, but this time I wanted to inspire others with disabilities and hopefully shift society’s perception of people with disabilities, which is why I did the bungee in a wheelchair.”\nAfter suffering a spinal injury that left him bedridden and unable to move for a long time, Sapkota now travels on a disability-friendly scooter and wheelchair, becoming a strong voice for thousands of people with disabilities.\nSapkota has been participating in paragliding, zipline, swing, and other adventure activities for a long time.\nHe is not only an adventure enthusiast but also a committed advocate for inclusive tourism. Despite his disability, he serves as the secretary of the Jugal Tourism Promotion and Environment Conservation Forum Nepal, continuously lobbying for accessible tourism. He believes that making trails, routes, and services in Nepal’s tourism sector accessible for people with disabilities must now be a mandatory agenda.\nDahal, who joined Sapkota in the bungee jump, has been living with spinal paralysis due to a motorcycle accident.\nHe has been using a wheelchair for four years. Dahal runs an agricultural nursery in Bhaktapur. Alongside the nursery, he also works as a graphic designer and social media manager, and holds leadership roles in various sports and entertainment-related organizations.",
        "url": "https://english.onlinekhabar.com/wheelchair-bungee-jump.html",
        "scraped_at": "2026-02-03T19:15:48.317000"
    },
    {
        "title": "Know what are yomaris and learn how to cook them on your own",
        "content": "Considered one of the signature dishes of theNewa community, yomari is arguably a local invention that is both sweet and healthy. On the full moon day of Thinlaa: (the second month of Nepal Sambat) or Marga Shukla Paksha, the Newa community celebrates Yomari Punhi, where primarily the households make yomari of various shapes and sizes. The day is also celebrated asJyapuDiwas or Dhanya Purnima. Meanwhile, the Kirant community celebrates it as Udhauli.\nIt is said yomari was first made by a Newa couple working in the field of Panauti. Since rice was the prime harvest, the couple decided to use the harvest and make yomari out of it. Also, since it was winter, they filled it withchaku(molasses) to increase body heat. As a part of the community, the couple also shared their harvest and yomari with the neighbours.\nThe signature shape of the yomari is also said to resemble the fig.\nAnother story is of Chhinnapatta Maiju and yomari, but this yomari is about the fig. According to a cultural expert and retired Nepal Bhasa professor at Tribhuvan University, Chunda Bajracharya, “In this folklore, we hear the story about two sisters. The elder is Chhinnapatta Maiju, who was disliked by her mother. She had a goat as her friend. Her mother killed her beloved goat and Chhinnapatta took the bones out and buried them in the ground. It is said a fig tree grew out of there and she used to spend more time there.”\nShe continues, “One day when she was up in the tree, lakhe and lasi: (a demon couple) came there and tricked her into bringing the fig down to them. Chinnapatta got kidnapped and then was taken to their abode. The demon couple directed her to make roti (flatbread) for them. While in the kitchen, a mouse came to Chinnapatta and asked for roti. The mouse, in return for the roti, warned her that the demon couple were planning to eat her, so she better run with all the jewels they had stored. Chinnapatta Maiju adhered to it and went home with the jewels.”\n“Seeing her coming back with the jewels, the mother questioned her on what happened. After Chinnapatta briefed them, the mother directed her younger daughter to get kidnapped and get more jewels from the couple. She did, but she ignored the mouse unlike her sister and failed to get the warning. The demon couple then slept with the girl in between and ate her.”\nAs an act of gratitude for the good harvest, it is a custom for the people to offer yomari to the gods and goddesses. It can be in any shape or size; more common are the signature shape of the yomari while others also make them in the shape of gods and goddesses.\nAs the day is celebrated in winter, people also follow the tradition of sitting in front of makal (traditional firepots) to keep themselves warm. “Many also eat roasted eggs, garlic, and potatoes while sitting around the fire. However, the tradition is rarely seen nowadays,” Bajracharya laments.\nChildren also go around to ask for yomari where the households share their fortune by giving it back to the community. Charity on the day is also very common, she adds.\nOther tradition includes guru puja (worshipping teachers) where people worship books and their teachers.\nChef Santosh Sah made yomari famous in the international cooking show Masterchef UK 2020. Looking at that, many are inclining towards tasting this local delicacy. With its newfound fame and the local festival in mind, here is how you can make yomari and enjoy this tasty delicacy at your own home:\nYou need a bowl of rice flour. You also need boiled water to make the dough.\nBoil water in a pot. Then, put the hot water in the rice flour, and mix them together. Knead the mixture and make it into a dough. [You have to be careful as the mixture can be hot to touch].\nWhen the dough is ready, wrap the dough in a cotton cloth. Leave it aside for half an hour or overnight.\nIn a pan or a pot, put water and chaku. With heat, the chaku turns into liquid. The mixture should be consistent and thick but runny. Mix black sesame seeds and powder into the pan, and mix all. Add cinnamon or cardamom for taste. Put it aside to cool down.\nMix a bit of water and make it a paste. In the paste, mix coconut, sugar, and almonds. Add cinnamon or cardamom for taste. And put it aside to cool down.\nPut oil on the palm. Take a dollop of the dough into your hands and give it the shape. Start on one side, roll the dough between your palms for an elongated tail or lower half of the yomari. On the top, poke a hole. With your index finger slowly start pressing and rolling the dough in your palms. Make the base like a vessel to put your fillings.\nPut a spoon of your fillings and cover the opening by slowly pressing the opening with your hands. Give shape to the top any way you like it.\nContinue the process to make as many yomari as you want.\nThe way you make yomari is just like making momos. So, you can use the same pot you would use to make momos.\nPut the water to boil.\nOil the pot base before putting in the yomari. Make sure there are gaps for the yomari so that they do not stick.\nWhen the water boils, keep the base on top of that to make yomari.\nCook it for 10 to 12 minutes.\nTake the hot yomari into a plate and serve it.\nGarnish it with chopped almonds or chocolate syrup or any ingredient you would like before serving.\nFrom thearchive.",
        "url": "https://english.onlinekhabar.com/yomari-punhi-newa-festival-nepal.html",
        "scraped_at": "2026-02-03T19:15:51.230174"
    },
    {
        "title": "With foreign talent and rising crowds, Nepal’s cricket finds fresh energy",
        "content": "Right now in Nepal, as the clock strikes either 11 am or 4 pm, thousands of people get excited about the same thing, watching theNepal Premier League. Cricket, over the past few years, has gained immense popularity among Nepalis as the national team has achieved major milestones, such as playing in the World Cup and retaining ODI status. The cricket fraternity of Nepal has accomplished feats that other sports communities in the country still dream of.\nThe second edition of the NPL features matches under floodlights and allows spectators to watch from the parapet, both happening for the first time in Nepal’s cricketing history, marking yet another milestone.\nIn a country currently experiencing intense political tension, cricket has, to some extent, created an environment where people can share moments of happiness.\nWhile this league continues to draw attention from thousands around the world, its significance for Nepal’s cricket fraternity, along with its challenges and future, remains an important topic of discussion.\nFormer captain of Nepal’s national cricket team, Gyanendra Malla, says that such leagues would first strengthen the status of the Cricket Association of Nepal (CAN), the cricket governing body of Nepal.\n“Once CAN becomes strong, a lot of positive changes will automatically occur in the cricket fraternity,” says Malla, who is also the coach of Karnali Yaks, one of the NPL franchise teams.\nHe further adds that such a league will open avenues to international leagues for Nepali cricketers in the coming days.\nEach team in the NPL includes eight foreign players. In the first edition of the NPL, Nepali players had the opportunity to play with or against big names such as Shikhar Dhawan, Martin Guptill, Ravi Bopara, and James Neesham. Similarly, big names in the second edition include Jason Roy and Sohail Tanvir, Faf du Plessis and others.\n“Gaining and sharing experiences with foreign coaches and cricketers will naturally help in the skill development of our players,” says Malla.\nIn theeight-decade-long cricketing historyof Nepal, this is the first time that such a large franchise cricket league has been organised by CAN.\nThe NPL also held a talent hunt where each team opened a camp and selected the best players, one included in the main squad and others in the development squad, allowing them to train with the team.\n“Exploring new domestic players from different parts of the country who could contribute to the future of Nepal’s national team is another significant step taken by the NPL,” says CAN spokesperson Chhumbi Lama.\nEchoing Malla, Lama says that sharing the same dressing room and playing alongside players from various backgrounds will further enhance the skills of Nepali players.\nBoth Malla and Lama say that, in addition to skill development and making the cricket sector vibrant, leagues like the NPL also help boost tourism and Nepal’s economy.\nNational cricket player Gulshan Jha says that the NPL has become a great learning platform for domestic players.\n“Besides the technical aspects, playing with players from different countries also helps mentally. It allows us to understand other players’ approaches to the game,” says Jha, who currently plays for Karnali Yaks.\nAccording to CAN, on average, around 6,000 spectators watch the NPL live at the TU International Cricket Ground. On Saturdays, the tickets get sold out, meaning 12,000 spectators watch the NPL live at the TU International Cricket Ground. Ticket prices range from Rs 500 to 2,000.Reportedly, the first edition of the NPL was viewed live by around 130,000 to 135,000 spectators.\nWhile the league is getting “bigger and better,” it also faces challenges.\nAccording to the concerned authorities, the first and biggest challenge in hosting the NPL is infrastructure.\n“Although we now have floodlights and well-managed parapets, we still need better infrastructure,” Lama says. “Seeing the growth of Nepali cricket, I am hopeful that we will get good infrastructure very soon.”\nFor the improvement of the league in the future, Malla suggests that the next edition be held in better weather conditions.\n“In the present weather, the pitch condition is not as good as it should be,” he says. “Better pitch conditions would make the matches even more interesting.”\nHe adds that the league would reach another level if it received full sanction from the ICC.",
        "url": "https://english.onlinekhabar.com/nepals-cricket-finds-fresh-energy.html",
        "scraped_at": "2026-02-03T19:15:54.055670"
    },
    {
        "title": "Nipah virus at Nepal’s doorstep: Why vigilance matters now",
        "content": "Nepal has not reported any confirmed cases ofNipah virusso far. However, recent infections in India’s West Bengal, including among doctors and nurses, show that the risk is close. Nepal has already started screening travellers at airports and land border points, but the real question is whether the country is fully prepared if a case does appear.\nNipah virus is rare but extremely deadly. Between 40 and 75 per cent of people who become infected do not survive, and there is no approved vaccine or specific treatment. For a country like Nepal, closely connected to India and facing rapid environmental and population changes, this is a public health threat that should not be ignored.\nThe World Health Organization lists Nipah virus among its top priority diseases because of its potential to trigger outbreaks with devastating consequences. Unlike many viruses that capture headlines, Nipah does not need large numbers to cause large damage. Even small outbreaks have overwhelmed health systems and left lasting social and economic scars.\nNepal shares an open and porous border with India, with millions crossing annually for work, healthcare, trade, and family ties. West Bengal, where recent Nipah cases have emerged, is directly connected to Nepal through multiple land routes. Human mobility is essential for livelihoods, but it also enables pathogens to move silently across borders.\nAirport and border screening are important first steps. However, Nipah’s incubation period can range from 4 to 21 days, and in some cases even longer. This means infected individuals may show no symptoms at the time of travel, making detection at entry points inherently limited.\nNipah virus is zoonotic, meaning it spreads from animals to humans. Its natural reservoirs are fruit bats, particularly those of thePteropusgenus, commonly known as flying foxes. These bats are widely distributed across South and Southeast Asia, including many parts of Nepal.\nTransmission can occur through direct contact with infected animals, consumption of food contaminated by bat saliva or urine, or close contact with infected people and their bodily fluids. In Bangladesh, repeated outbreaks have been linked to the consumption of raw or fermented date palm sap contaminated by bats. While this specific practice is uncommon in Nepal, the broader risk, food and drink exposed to wildlife, is very real.\nCrucially, the strain of Nipah circulating in India and Bangladesh can spread from person to person, particularly in households and healthcare settings. This has been documented repeatedly, often affecting caregivers and health workers. In recent Indian outbreaks, doctors and nurses were among those infected, an alarming reminder of how quickly health facilities can become amplification points.\nNepal’s vulnerability to zoonotic diseases like Nipah is shaped not only by geography, but also by rapid environmental and social change. Over recent decades, forest cover has expanded in many regions due to conservation success. At the same time, human settlements have pushed closer to forest edges.\nIn districts such as Chitwan, Pokhara, Gulmi, and Mustang, community members report seeing more wild animals near homes and farms—monkeys, deer, wild boar, porcupines, and bats. Bats are frequently observed roosting near cattle sheds, sometimes biting calves. These everyday interactions, often considered normal, are precisely where spillover events can occur.\nCultural practices also matter. In some communities, wild animals are still hunted or consumed despite legal restrictions. Bats have been used in traditional medicine, while wildlife meat consumption, though declining, has not disappeared entirely. These practices do not imply blame; rather, they highlight the need for culturally sensitive public health communication that respects tradition while reducing risk.\nAs one health practitioner noted, Nepal’s increasing population, habitat encroachment, and open border with India together create “very favourable conditions” for the emergence or re-emergence of zoonotic diseases. Nipah is a textbook example of such a threat.\nNipah infection often begins with non-specific symptoms: fever, headache, muscle pain, vomiting, or sore throat. This makes early detection difficult, especially in Nepal, where febrile illnesses are common, and healthcare access varies widely.\nIn severe cases, the virus attacks the brain, causing encephalitis. Patients may develop confusion, drowsiness, seizures, and coma within days. Pneumonia and severe respiratory distress can also occur. Even among survivors, long-term neurological complications, such as persistent seizures or personality changes, have been reported. In rare cases, the virus can reactivate months or years later.\nTreatment is limited to intensive supportive care. There is no proven antiviral therapy and no licensed vaccine. This reality makes prevention, early detection, and infection control far more important than clinical treatment alone.\nWhat Nepal should do now\nNepal still has a critical window to prepare before a crisis emerges. Several steps are essential:\nFor the general public, simple measures matter: avoiding consumption of fruits that may be contaminated by bats, minimising contact with wild animals, practising hand hygiene, and seeking prompt medical care for severe illness—especially after travel to affected regions.\nNipah virusis not new. It has been known for more than two decades, and its patterns are well documented. What remains uncertain is whether countries act decisively before outbreaks occur or only after lives are lost.\nNepal has no Nipah cases today. That is precisely why this moment matters. Vigilance now quiet, informed, and sustained offers the best chance to ensure that Nipah remains a warning from across the border, not a headline at home.\n\n\n",
        "url": "https://english.onlinekhabar.com/nipah-virus-at-nepals-doorstep-why-vigilance-matters-now.html",
        "scraped_at": "2026-02-03T19:15:57.584244"
    },
    {
        "title": "60 per cent of doctors fail Nepal Medical Council licensing exam",
        "content": "Kathmandu, January 28\nSixty per cent of doctors have failed the name registration (licensing) examination conducted by the Nepal Medical Council. Registrar Dr Satish Kumar Dev said that only 39.45 per cent of candidates passed the 74th licensing examination for MBBS and BDS.\nThe computer-based examination was held on Tuesday and Wednesday at the examination centre of the Institute of Engineering Studies in Pulchok. Of the 943 candidates who appeared for the exam, only 372 passed.\nA total of 967 MBBS and BDS graduates had submitted application forms for the licensing examination. Among them, 24 were absent, according to Dr Dev.\nIn the medical stream (MBBS), 793 candidates submitted forms, of whom 775 appeared in the examination. Only 300 candidates, or 38.7 per cent, passed.\nSimilarly, in the dental stream (BDS), 174 candidates submitted forms, but only 168 appeared for the exam. Of them, 72 candidates, or 42.85 per cent, passed, the Council said.\nThe results have raised questions about the academic quality of universities and colleges teaching medical science. However, Registrar Dr Dev claimed that the number of candidates who failed this time includes a higher proportion of those who had already failed previous examinations.",
        "url": "https://english.onlinekhabar.com/60-per-cent-of-doctors-fail-nepal-medical-council-licensing-exam.html",
        "scraped_at": "2026-02-03T19:16:00.588575"
    },
    {
        "title": "Gold, silver prices set new records",
        "content": "Kathmandu, January 28\nGold price has set a new record in the domestic market, with the precious metal being traded at Rs 318,800 per tola (11.66 grammes) today. Similarly, the silver price has also reached an all-time high, trading at Rs 7,300 per tola.\nAccording to the Nepal Gold and Silver Dealers’ Association, gold was traded at Rs 309,300 per tola on Tuesday, and the price surged by Rs 9,500 per tola in a single day.\nLikewise, silver, which was traded at Rs 6,870 per tola on Tuesday, has also seen a significant rise. International media reports indicate that gold is currently trading at USD 5,200 per ounce, while silver is priced at USD 111 per ounce.\n",
        "url": "https://english.onlinekhabar.com/gold-silver-prices-set-new-records.html",
        "scraped_at": "2026-02-03T19:16:03.644583"
    },
    {
        "title": "Decrease in gold, silver prices",
        "content": "Kathmandu, January 30\nBreaking the continuously increasing trend, the gold and silver prices have declined in the domestic market today, the last trading day of the week. According to the Federation of Gold and Silver Dealers’ Association, the price of gold has been set at Rs 318,800 per tola (11.66 grammes) today against Rs 339,300 per tola on Thursday.\nSimilarly, silver is being traded at Rs 7,065 per tola today. It was Rs 7,505 on Thursday. The gold price was determined at Rs 318,800 per tola on Wednesday, while the price of silver per tola was Rs 7,300 per tola.\nLikewise, gold was traded at Rs 309,300 per tola and silver at Rs 6,870 per tola on Tuesday. According to international media, gold is being traded at 5,537 US dollars per ounce and silver at 117 US dollars per ounce in the international market today.\n",
        "url": "https://english.onlinekhabar.com/decrease-in-gold-silver-prices.html",
        "scraped_at": "2026-02-03T19:16:06.785085"
    },
    {
        "title": "Gold price reaches Rs 339,300 per tola, setting historic record",
        "content": "Kathmandu, January 29\nThe price of gold in the domestic market has reached Rs 339,300 per tola today, setting a historic record. Likewise, the price of silver has also set a new record, reaching Rs 7,505 per tola (11.66 grammes).\nAccording to the Federation of Nepal Gold and Silver Dealers’ Association, on Wednesday, the price of hallmark gold was Rs 318,000 per tola while that of silver was Rs 7,300 per tola. Lately, the prices of gold and silver continue to rise significantly.\nOn Tuesday, the gold was traded at Rs 309,300 per tola while the price of silver was Rs 6,870 per tola. According to international media, gold is trading at 5,560 US Dollars per ounce, while silver is at 120 US Dollars per ounce.\n",
        "url": "https://english.onlinekhabar.com/gold-price-reaches-rs-339300-per-tola-setting-historic-record.html",
        "scraped_at": "2026-02-03T19:16:12.268520"
    },
    {
        "title": "Nepal’s election campaign gains pace but manifestos remain absent",
        "content": "As the House of Representatives election scheduled for March 5 draws closer, candidates have already begun campaigning. They are meeting voters and conducting door-to-door outreach in their constituencies to seek public support. On digital platforms, too, candidates have been strengthening their presence with the same aim.\nOne critical element, however, is missing: none of the political parties has released a manifesto. A manifesto is among the most important tools in an election, offering voters a clear basis on which to judge candidates and parties. Yet parties appear to be avoiding this essential responsibility.\nAs of this writing, just 36 days remain until the election, but no party has published its manifesto. Candidates are therefore campaigning without clearly articulating their policy priorities or governing vision.\nThe election date was announced six months ago, following the formation of an interim government under Prime Minister Sushila Karki after the Gen Z–led protests of September 8 and 9. Political parties had ample time to prepare and present their manifestos. Their failure to do so has prompted growing public concern.\nPolitical analyst Saugat Gautam says that because all major parties have already selected their prime ministerial candidates, many contenders are focused more on promoting those figures than on communicating their own plans and agendas. As a result, he says, the campaign has become increasingly centred on individuals rather than policies.\n“The sooner the manifesto is published, the better,” Gautam says toOnlinekhabar. “If there is a delay, people will have less time to critically assess it.”\nConcerns over the delay have also been voiced on social media. Rakshya Bam, a Gen Z activist, has publicly urged parties to release their manifestos as soon as possible.\n“We want to read your manifesto,” shewrites. “The public will vote based on the plans and agendas you intend to implement after becoming parliamentarians. Be accountable to the people and publish your manifesto.”\nOnline criticism has continued to grow, though political parties appear largely unresponsive. Writer Srijana Pokhrelnotedin a recent social media post that more than a dozen candidates contesting the election are her Facebook friends, representing different parties. She said she reviewed each of their profiles but did not find a single candidate who had pinned their party’s manifesto.\nPokhrel also criticised candidates who ask voters to judge them by their records, arguing that such records are often “disgraceful.” At the same time, she questioned candidates with no political track record, asking whether they expect voters to support them based solely on an introductory video. “This is an election, not a beauty pageant,” she wrote.\nThe Nepali Congress, for its part, says it is still in the preliminary phase of drafting its manifesto.\n“We are still at an initial stage and are consulting experts from different sectors,” says Pratap Paudel, political adviser to Gagan Thapa, the party’s president.\nPaudel says the manifesto had not been delayed, adding that election-related activities already underway may have created the perception that its release was overdue. “In fact, manifestos are usually announced only about a month before the election,” he said. He added that Thapa is currently campaigning in Sarlahi and that a party meeting will decide the date of publication after his return.\nThapa is leading the manifesto drafting process for the Nepali Congress.\nUnlike the Nepali Congress, the CPN-UML says it is in the final stage of preparing its manifesto.\n“We are almost ready to publish it,” says Min Bahadur Shahi, head of the party’s publicity department.\nShahi said a few issues still required internal discussion before the manifesto could be released.\n“We are trying to publish it as soon as possible,” he added.\nThe Rastriya Swatantra Party has informed that it plans to release its manifesto on February 13.\n“We are reviewing the draft and compiling suggestions and findings from provincial consultations and field studies,” says Manish Jha, the party’s spokesman.\nThe manifesto is being drafted under the leadership of Swarnim Wagle, the party’s vice chairman. Jha said that because candidate nominations were filed 45 days ahead of the election, compared with 17 days in previous cycles, many people felt the manifesto announcement was overdue.\nKrantishikha Dhital, a central committee member of RSP actively involved in drafting the manifesto, said the party would release practical and achievable pledges rather than grand, unrealistic promises.\n“We are not preparing impossible or irresponsible declarations. The manifesto is being drafted in a way that directly addresses the concerns of young people,” says Dhital. “We will come forward soon with proposals that reflect the public’s expectations. Our focus will be on education, health care, employment and capital formation.”\nWith just over five weeks remaining before voters go to the polls, the absence of manifestos has left many unsure how to compare candidates beyond personalities and past affiliations, raising broader questions about accountability and policy-driven debate in the campaign’s final stretch.\nParty leaders also acknowledge that delays in releasing the manifesto could make it more difficult for voters to compare candidates.",
        "url": "https://english.onlinekhabar.com/nepals-election-manifestos-absent.html",
        "scraped_at": "2026-02-03T19:16:17.009460"
    },
    {
        "title": "National Assembly election report presented to President Paudel",
        "content": "Kathmandu, January 28\nThe report on the National Assembly election held on January 25 has been submitted to President Ramchandra Paudel. Officiating Chief Election Commissioner Ram Prasad Bhandari presented the report to the President at a ceremony held at the Rastrapati Bhawan, Shital Niwas, today.\nHigh officials, including the Commission’s two commissioners, Sagun Shamsher JBR and Dr Janaki Kumari Tuladhar, and Secretary Krishna Bahadur Rau,t were present on the occasion.",
        "url": "https://english.onlinekhabar.com/national-assembly-election-report-presented-to-president-paudel.html",
        "scraped_at": "2026-02-03T19:16:21.258237"
    },
    {
        "title": "Metamorphosis: Saurab Koirala brings nature and memory to life",
        "content": "Amid the frenzy of an election season, when public attention is fixed on power shifts and the anticipation of the next prime minister, the exhibition Metamorphosis atTaragaon Nextoffers a quiet pause. In Boudha, a place shaped by layers of history and living culture, the exhibition invites visitors to reflect on a deeper truth that the land we proudly call ours is not ours alone, but a shared home with the habitats that surround and sustain us.\nArtist Saurab Koirala weaves together the past and the present to evoke a sense of shared belonging, urging viewers to think about a future shaped by what we choose to protect or neglect. Through this dialogue between memory and modernity, the exhibition becomes a gentle but powerful reminder of what may be lost if these habitats disappear.\nAs you enter the gallery, the first thing that strikes you is the huge metal haron spreading its wings, which seems to be in a position to attack. Nevertheless, the haron is placed near the crab, which seems to attack the crab.\nLikewise, there is a battle between the queen wasp and the ant. The wasp is running after the little ant who has stolen her babies. With the placement of the wasp comb and a few dried leaves, sculptures made of rusty, ignored junk magically come alive.\nThe exhibition features 26 sculptures made from waste materials, shaped into animals, birds, insects, and other elements of fauna. Koirala is a self-taught artist who previously worked as a concept artist, designing characters for animation—a background that influenced his approach to sculpture.\n“When I worked in an animation studio, I had to design various characters and study their movements and body structures,” Koirala says.\nIn the exhibition, most of the sculptures are not static but appear to be in motion. As an artist, Koirala draws on memories of his childhood, which he spent closely connected to nature, and now seeks to capture that essence while reminding viewers that the earth is home to all living creatures.\nHe says, “During the rainy season in my hometown, Biratnagar, there used to be many snails and crabs, and herons would come to the fields to feed on them, something rarely seen these days. Through my art, I am reliving those moments and memories, and raising awareness in society that we need to consider the lives of other creatures as well.”\nUntil 2018, Koirala was unaware of his own potential. He says, “I focused on paintings, digital art, and illustration. But when I participated in the WastArt Competition in 2018, I created a Danphe sculpture from Coke and soda cans. It is now part of the permanent collection at Sagarmatha Next Art Gallery in Syangboche. That experience made me realise that I have the potential to turn trash into art.”\nMoreover, he credits his mother, Yashoda Koirala, for inspiring his artistic journey. “My mother used to build houses and temples from discarded cardboard boxes and clay. When I think about how I got into art without any formal education, it all goes back to her,” says Koirala. “She used to be so happy immersed in her creations, and I wanted to feel that same joy, which unconsciously guided me toward art.”\nAs a tribute to his mother, some of Yashoda’s artworks are also on display. Koirala says art, for him, lies in the moments of creation, which feel void, silent, and empty. It provides an environment that allows him to escape worldly concerns and the constant pressure to stay mindful. The exhibition is an invitation to step into the artist’s world and witness memories, nature and imagination brought to life.\nIf you want to experience the quiet power of creation and see how void, silence, and emptiness can be transformed into art, visit the exhibition, open until January 31.",
        "url": "https://english.onlinekhabar.com/metamorphosis-saurab-koirala-brings-nature-and-memory-to-life.html",
        "scraped_at": "2026-02-03T19:16:25.655988"
    }
]