[
    {
        "title": "NOW Sports Membership Q&A: How do I stream Sky Sports? Is it instant? Is there a contract?",
        "content": "Football\nThe below content is an advert\nMonday 15 December 2025 17:07, UK\n\nWhat is NOW?\nNOW is an instant streaming service offering access to all 12 Sky Sports channels, every Sky Sports+ stream, and much more.\nIt's an app, so customers can sign up and stream instantly across over60 devices. It offers contract-free memberships options, so customers can cancel anytime!\nYou can choose between a Month or Day Memberships. The latest prices for each Membership option can be foundhere.\nSounds great! What channels do I get?\nMemberships gives you access to:\nNOW Sports Memberships also give customers access to all live Sky Sports+ streams as well as Sky Sports documentaries and selected replays and highlights on demand within your Membership period.\nN.B. Customers cannot access Sky Sports Box Office events via NOW.\nThis content is an advert\nSo, I don't need a smart TV, stick or set-top box to get NOW?\nNo - you don't need one. You can watch NOW on over 60 different devices, including selected smart TVs and sticks, but also on smartphones, PC or Mac, plus PS4/PS5™, Xbox One & Xbox Series X/S consoles.\nWatch online at NOWTV.com or download the app to watch on your smartphone, smart TV or games console.\nSee our full listof compatible devices.\nIf I sign up to NOW on one device, can I watch it on another?\nYes - you can sign up on one device and watch on another device of your choice. This sign-in journey varies by platform, but on Smart TVs for instance, you will be given a QR code function to sign in quickly.\nHowever, customers without Boost cannot watch NOW on two devices at the same time.\nThe match I want to watch starts in 10 minutes, is the Membership instant?\nYes!\nThis content is an advert\nCan I watch without a contract?\nYes, NOW offers contract-free Sports Month & Day Memberships options, so customers can sign up and cancel anytime.\nFor your fully flexible Sports Month Membership, you'll still be able to stream until the end of that 30-day viewing period. If you don't cancel, it renews automatically at the end of the 30-day period.\nWhat sports can I watch?\nHow many devices can I watch on at the same time?\nYou can watch on one device as standard, up to two devices at the same time with NOW Boost, or up to three devices at the same time with NOW Ultra Boost.\nWhat are NOW Boost and NOW Ultra Boost?\nUpgrading to Boost means you can watch in Full HD, enjoy Dolby Digital 5.1 with your sound system or soundbar, get an extra device to stream on, and watch on-demand content ad-free.\nUpgrading to Ultra Boost means you can watch in up to 4k UHD HDR, enjoy Dolby Atmos with your sound system or soundbar, get two extra devices to stream on, and watch on-demand content ad-free. Check device compatibilityhere.\nTo add Boost or Ultra Boost to your Sports Membership, head over to My Account section of the NOW website.\nThis content is an advert\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11095/13078979/now-sports-membership-q-a-how-do-i-stream-sky-sports-is-it-instant-is-there-a-contract",
        "scraped_at": "2026-02-03T19:21:28.028447"
    },
    {
        "title": "South Asians In Football",
        "content": "Football\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/topic/9087/south-asians-in-football",
        "scraped_at": "2026-02-03T19:21:28.901527"
    },
    {
        "title": "Casemiro: Why Manchester United are not prepared to U-turn on Brazilian midfielder despite excellent Premier League form",
        "content": "Football\nMan Utd won't U-turn on the decision to allow Casemiro to leave when his contract expires in June despite improved Premier League form under Michael Carrick; the club are forward planning and expected to chase a number of midfield targets in the summer, with Elliot Anderson top of list\nFootball Correspondent@RobDorsettSky\nMonday 2 February 2026 15:50, UK\nManchester United midfielder Casemiro is in his richest vein of form since arriving at Old Trafford in a deal worth £70m in 2022. So why would the club let him go now?\nThe veteran Brazil international, who turns 34 later this month, rolled back the years asMan Utd picked up another dramatic win over Fulham on Sunday, heading in the opener before setting up Matheus Cunha's goal with a sublime no-look pass.\nSky Sports'Jamie Carraghercalled him a \"completely different player\" while Paul Merson hailed his impact alongside Kobbie Mainoo and Bruno Fernandes during this recent renaissance under Michael Carrick.\nPlease use Chrome browser for a more accessible video player\n\nCasemiro has started all three games under Carrick, but made his impending departure official last month while Ruben Amorim was still in charge. United did hold the option to trigger a 12-month extension, but with a midfield overhaul planned for the summer it was decided that Casemiro would be allowed to leave.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News'Rob Dorsett explains the club's stance after calls from fans to U-turn on the decision.\nFollow Sky Sports on WhatsApp for the latest sports news, videos, features, analysis and much more\n\"Manchester United are determined not to have a short-term approach to signings and managers. That's what has got them into trouble in the past. It's left a lot of big-name players on big wages who are not part of the plans.\n\"Casemiro is flying right now. Player of the match against Fulham. I can understand why a lot of fans are saying: 'we're trying to find a midfielder but willing to let Casemiro go?'\nMan Utd fixtures\nMan Utd news and transfer latest\nWatch FREE Premier League highlights\nStream the Premier League with no contract\n\"He turns 34 later this month, he's one of the biggest earners at the club, £325k a week, and Man Utd know that can't go on forever. He's playing out of his skin right now but they have to have a longer-term plan.\n\"Casemiro will leave in the summer, they have done the big goodbye video and there is no going back on that.\"\nPlease use Chrome browser for a more accessible video player\n\nSky Sports'Paul Merson:\n\"I think it is. He has done brilliantly well, playing with Kobbie Mainoo and Bruno Fernandes in there makes a difference.\n\"He's got to move on. He's 34 and before you know it, he's 35. He's been a top player; he's had a lot of unworthy stick because he hasn't got the legs to play on his own in midfield if Fernandes pushes forward.\n\"Mainoo has helped that a lot - common sense by Michael Carrick. But we're talking about the future of Man Utd and they are right to be doing what they're doing and letting him go.\"\nSky Sports News'Rob Dorsett:\n\"Midfield is where Man Utd feel they will focus the bulk of their spend in the summer.\n\"Carlos Balebaat Brighton is on their list,Elliot Andersonat Nottingham Forest, they likeAdam Wharton,andJoao Gomesat Wolves so there's a number of options. They may even do two.\n\"Window by window, they are prioritising areas of the team. It's a very data-led approach. Last summer the priority was to score more goals so that's why they pumped £280m into three forward players.\n\"Now they are wanting to solve the next imbalance and are going to address midfield. I get the impression Anderson is top of the list but we're talking over £100m.\"\nPlease use Chrome browser for a more accessible video player\n\nSky Sports'Laura Hunter:\nThe logic here is obvious. Casemiro is an aging midfielder, whose stamina has been questioned repeatedly over the past 18 months. Perhaps some of the blame lies at the door of previous manager Ruben Amorim, as it was clear to most that Casemiro no longer had the legs to be the heart of the engine room. The rebalance with Kobbie Mainoo has proved invaluable.\nClearly, he's still got plenty to offer Man Utd between now and the end of the season, though. Maybe beyond. But time is against him and a recalibration of the wage bill is necessary if the club want to chase top targets in the summer.\nNevertheless, Casemiro's worth can still be underlined by his numbers. He's scored as many goals as Fernandes (five) in the Premier League this season - also equal to Benjamin Sesko. His aerial ability makes him a huge threat from set-pieces, with four of those goals headers.\nDefensively he's made the most tackles (52) of any Man Utd player and recovered the second-most possessions in midfield (51), behind Fernandes. His duels won (107) can only be bettered by Patrick Dorgu. And his quality on the ball is undeniable.\nThis latest upturn will ensure he gets a big send-off in May. But before then, he's proving a highly resourceful and reliable asset for Carrick to call upon.\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11667/13502285/casemiro-why-manchester-united-are-not-prepared-to-u-turn-on-brazilian-midfielder-despite-excellent-premier-league-form",
        "scraped_at": "2026-02-03T19:21:29.713658"
    },
    {
        "title": "Jean-Philippe Mateta: Crystal Palace striker considering knee surgery after failed winter move to AC Milan",
        "content": "Football\nCrystal Palace's Jean-Phillipe Mateta saw Deadline Day move to AC Milan collapse due to a knee issue; striker considering knee surgery with playing at this summer's World Cup for France on his mind; Mateta devastated over failed Milan move - but he is expected to leave Palace this summer\nTuesday 3 February 2026 13:29, UK\nPlease use Chrome browser for a more accessible video player\n\nCrystal Palace striker Jean-Philippe Mateta is considering undergoing knee surgery following his failed move to AC Milan.\nMateta saw his move to the Italian giants collapse on Deadline Day after his medical highlighted problems with his knee, but it is thought there is no bad blood between the two clubs after the transfer was called off.\nMilan were aware of the issue before negotiations started with Palace - his medical records were sent to Italy on Saturday - in advance of the final negotiations.\nThe Serie A club also sent their own club doctor over to London to further investigate, before finally pulling out of the £26m deal.\nJuventus also hold a long-term interest in the France international, and they too looked into a late move for Mateta once Milan had withdrawn their interest, but again, the knee issue put them off making a formal offer.\nMateta, who has had a knee problem since November, has been playing with pain for several months, and Palace have been managing it game by game.\nBut the 28-year-old will now have discussions with a knee specialist before making a decision on whether to have an operation.\nTransfer Centre LIVE!\nCrystal Palace fixtures\nWatch FREE Premier League highlights\nStream the Premier League with no contract\nThe timing of the surgery is a key decision, with Mateta hopeful of making France's World Cup squad this summer.\nDiscussions will take place with Palace and with the surgeon to decide the best course of action.\nOptions include him continuing to play with pain and managing the injury, or to undergo surgery soon, which could mean several months on the sidelines.\nWhatever the decision over surgery, Mateta, who has 18 months left on his Palace contract, is set to leave Selhurst Park this summer.\nSky Sports Newsunderstands he is devastated, disappointed and upset after his failed move away from the club in the winter window.\nHe unfollowed Palace on Instagram over the weekend, and he posted a fed-up emoji.\nIt remains to be seen if he is in the right frame of mind to play for Oliver Glasner's side, who go to rivals Brighton on Sunday, live onSky Sports.\nIf Mateta is unavailable for the trip to the south coast, then Palace could hand a debut to new club-record signing Jorgen Strand Larsenafter the striker's £48m Deadline Day move from Wolves.\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11661/13502694/jean-philippe-mateta-crystal-palace-striker-considering-knee-surgery-after-failed-winter-move-to-ac-milan",
        "scraped_at": "2026-02-03T19:21:30.479101"
    },
    {
        "title": "Sandro Tonali: Eddie Howe does not see Newcastle midfielder becoming unsettled amid reported Arsenal interest",
        "content": "Football\nNewcastle boss Eddie Howe says it was a risk to not sign any players in January transfer window, particularly in defence;watch Man City vs Newcastle in Carabao Cup semi-final second leg on Wednesday, live on Sky Sports from 7pm; kick-off 8pm\nTuesday 3 February 2026 11:23, UK\nPlease use Chrome browser for a more accessible video player\n\nNewcastle head coach Eddie Howe says he does not see Sandro Tonali becoming \"unsettled\" amid renewed transfer interest.\nThere were reports on Deadline Day that Tonali's agent had offered the player to Arsenal, and the Magpies had rejected an approach.\nHowever,Sky Sports Newsunderstands Newcastle had no contact from the Gunners for Tonali. His agent Giuseppe Riso also insisted he had not offered the Italian to other clubs.\nIt was a hot topic for Howe at his pre-match press conference ahead of their Carabao Cup semi-final second leg at Manchester City on Wednesday, live onSky Sports.\nSome drew comparisons between Tonali's current situation and that of Alexander Isak, who ended up moving to Liverpool last summer in a protracted transfer saga.\nBut Howe was sure that Tonali would not become unsettled by transfer rumours, saying: \"I don't think so, but lots of things happen without my knowledge.\n\"As far as I'm aware, we've got player who is an outstanding footballer, an outstanding person. He's very happy here, he's got a great relationship with me, his teammates, and seems really happy within himself.\nNewcastle news and transfer latest\nStream the Premier League with no contract\nDownload the Sky Sports App\nGet Sky Sports\n\"That would surprise me [if Tonali became unsettled], but our best players will always attract glances from other clubs - that's just the reality of football.\n\"We want to keep our group together, we want to be progressive and Sandro plays a part in that. All encompassed, I don't see an issue but I don't control everything.\n\"There was certainly no intention from our side to lose Sandro at all. He's such an integral player to what we're doing. He's very happy here.\n\"He is absolutely fine. I had discussions with him yesterday [Monday] and he is absolutely focused on playing for us.\n\"His only focus is Man City and trying to win that game. There's absolutely no issue with Sandro himself and he's committed.\"\nWhen asked what the club could learn from Isak's saga to help them now, Howe added:\"Probably a lot, but stuff that's above me, I think.\n\"In the summer, we didn't have a sporting director, which massively impacted our way of working, in terms of dealing with agents and that situation.\n\"We were in a more vulnerable position than we are now. Ross [Wilson] has filled that position and is showing really good leadership in dealing with transfers and all the things that it entails. We're in a strong position now to navigate those waters with a calmer, clearer way.\"\nNewcastle made no signings during the January transfer window, despite areas like their defence being in need of attention.\nWith the club still in four competitions, Howe admitted it is a risk to be depleted at the back given their busy fixture schedule.\nHe said: \"Yes [it is a risk], but we were left with no other option really. Every decision we make has a long-term implication. There's no guarantees that signing someone with the funds we had available would help us short term anywayn - so it is what is is.\n\"We've been used to working in these conditions now for a while. We've only been active in one transfer window out of the last four or five.\n\"We're under financial restrictions, we have to be really smart, so we've decided to wait until the summer. The decision is the summer window is easier to recruit. There's a lot more players available and potentially better value for money.\n\"But we also had a very limited amount of money to use in this window, were the right players available to help us in the very short term, which we have a need [for].\n\"Those options weren't there for us, so we can't sign players that don't exist and we have to work under the conditions we're in.\"\nPlease use Chrome browser for a more accessible video player\n\nThe Magpies have long had to work within the confines of the Premier League's Profit and Sustainability Rules, which Howe says has been affecting their ability to sign players.\nHe added: \"It's impacting us. It's been impacting us for a number of years, but we have to follow the rules otherwise there's points deductions and other sanctions placed upon us.\n\"It would have detrimental effects to what we're doing, so we're trying to fall in line, be progressive and move forward. That's an ongoing challenge for us.\"\nThe Athletic'sDavid Ornstein, speaking onSky Sports Newson Transfer Deadline Day, said of the Tonali reports: \"A complicated one. Unless you're fully on the inside, you don't know the exact ins and outs of it all.\n\"Arsenal have had an admiration of Tonali for a long time, dating back years. A few of us had reported on it.\n\"Arsenal had the injury to Mikel Merino coming into the deadline. There was a possibility they would move in the market for potential cover.\n\"I don't think anyone thought Tonali would be on the agenda, with good reason. There was never any chance of him leaving Newcastle.\n\"We established across the course of the day that there were absolutely no talks between Newcastle and Arsenal. No club-to-club contact at all.\n\"But a representative of Tonali, and there is some conjecture about how many people represent him, reached out to Arsenal and their sporting director Andrea Berta and offered the player to the club.\n\"And for Berta, it's his job to explore these situations and look into viability with the agent. And it became clear very quickly that there was no viability.\n\"Newcastle had no intention of opening any doors to Tonali leaving either now or in the future. If they did, the price would be way too high for Arsenal's capabilities at this moment in time.\n\"Complete perplexion at Newcastle. They had no talks, no contact, no communication and no intent of letting him go. I don't think it was ever on to be off.\"\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11095/13502640/sandro-tonali-eddie-howe-does-not-see-newcastle-midfielder-becoming-unsettled-amid-reported-arsenal-interest",
        "scraped_at": "2026-02-03T19:21:31.355014"
    },
    {
        "title": "Jeremy Jacquet transfer news: Liverpool sign Rennes defender in £60m deal with 20-year-old moving to Anfield this summer",
        "content": "Football\nLiverpool have signed Rennes centre-back Jeremy Jacquet for £60m; the 20-year-old will remain at Rennes for the rest of the season before moving to Anfield in the summer; the champions are short of numbers in central defence and Ibrahima Konate may leave for free this summer\nMonday 2 February 2026 23:22, UK\nLiverpool have confirmed a £60m deal for Jeremy Jacquet, with the Rennes centre-back to join in the summer.\nThe 20-year-old completed his medical with the champions on Deadline Day and will move to Anfield on July 1.\nLiverpool have agreed to pay a fixed fee of £55m plus a potential £5m in performance-related add-ons.\nChelsea offered exactly the same deal as Liverpool but over the past 48 hours, when it became apparent that Mamadou Sarr would be returning to Stamford Bridge and Josh Acheampong was staying, the player changed his mind and decided to move to Anfield.\nIt is believed he is likely to play more regularly there in the long term as Chelsea's squad is overloaded with young centre-backs.\nMeanwhile, Liverpool are not as blessed with options at centre-back. Virgil van Dijk and Ibrahima Konate are currently their only fit senior players in that position, with Joe Gomez and Giovanni Leoni injured.\nKonate's contract expires at the end of the season and he could leave for free in the summer. Jacquet is being signed after Liverpool's Deadline Day move for Marc Guehi from Crystal Palace last summer collapsed at the last minute.\nLiverpool news and transfer latest\nWatch FREE Premier League highlights\nDownload the Sky Sports App\nLiverpool fixtures\nMan City signed Guehi from Palace for £20m in this transfer window, six months before his contract expired. Liverpool were keen on him in the summer on a free transfer, but not at the price City paid in January.\nFollow Sky Sports on WhatsApp for the latest sports news, videos, features, analysis and much more\nFrench football expert Julien Laurens:\n\"He's the real deal. I know he's only 20, he hasn't played for France and he hasn't played in the Champions League or Europa League.\n\"He has a long way to go but he's been impressive last season, after they [Rennes] called him back from his loan in the second division, and this season, with Habib Beye.\n\"You can't get it wrong. He is going to be amazing.\nPlease use Chrome browser for a more accessible video player\n\n\"He reminds me of when William Saliba burst onto the scene in France with Saint-Etienne, or Wesley Fofana.\n\"It's about how much you value that potential and talent. You would pay a lot of money for someone who hasn't really proved much. It's a lot of money for such a young player.\"\nEuropean football expert Kevin Hatchard on Sky Sports News discussing Jeremy Jacquet:\n\"He's been seen as a rising star for quite some time. He's been a captain at numerous youth groups for France and seen as somebody who has all of the building blocks you need to be a modern centre-back.\n\"He's good on the ball, good passing range, athletic, great in the air - but he doesn't have a long record of top-level football.\n\"He had a loan at Cleremont that went well. He's been playing for Rennes this season, but it shows you just how much they rate him that they really didn't want to let him go in this window.\n\"His coach Habib Beye said 'if we let him go this season, we'll have to downgrade our goals for the season'.\"\nSky Sports' Paul Merson:\nPlease use Chrome browser for a more accessible video player\n\n\"I found it extraordinary that [Jacquet] is coming in the summer. They need a centre-half now to get top four or top five.\n\"It surprises me. It's a good signing - as a Chelsea fan I'm shocked he hasn't come to Chelsea, but I'm glad Acheampong is now staying.\n\"I'm majorly shocked. I don't know why, for the life of me, he's staying in France until the start of next season. With that kind of money, you want him now!\"\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11669/13502234/jeremy-jacquet-transfer-news-liverpool-sign-rennes-defender-in-lb60m-deal-with-20-year-old-moving-to-anfield-this-summer",
        "scraped_at": "2026-02-03T19:21:32.133476"
    },
    {
        "title": "Tammy Abraham's disallowed equaliser: New Brentford footage shows ball did go out of play against Aston Villa",
        "content": "Football\nAston Villa were controversially denied an equaliser by VAR in 1-0 defeat to Brentford; Tammy Abraham scored but VAR ruled ball had gone out of play 19 seconds beforehand; the Bees released footage on Monday afternoon that appeared to show the whole ball had gone out of play\nMonday 2 February 2026 18:33, UK\nPlease use Chrome browser for a more accessible video player\n\nBrentford have released footage that appears to show the ball did go out of play in the build-up to Tammy Abraham's equaliser for Aston Villa, before it was disallowed by VAR.\nThe four-second clip, posted onXon Monday afternoon, shows the ball cross the line before Leon Bailey hooks it back into play.\nThe post on Brentford's official account was accompanied by a caption referencing Law 9.1 of IFAB's Laws of the Game: \"The ball is out of play when it has wholly passed over the goal line or touchline on the ground or in the air.\"\nAbraham thought he had marked his Villa return with an equaliser against Brentford in a game that Unai Emery's side went on to lose 1-0.\nBut a lengthy VAR review followed, eventually determining Bailey had carried the ball out of play 19 seconds before the goal was scored.\nReferee Tim Robinson said the ball was \"factually out of play\" but, initially, there was a question as to whether there was conclusive footage to confirm it had crossed the line completely.\n\"I think it is not fair,\" Emery said after the game. \"The referee is not watching it.\nLatest Aston Villa news\nWatch FREE Premier League highlights\nLive Premier League table\nAston Villa 0-1 Brentford - Match report\n\"Maybe there are a lot of actions and circumstances that can change a goal. I accept it completely. For me it is not fair, but I accept it.\"\nJamie Carragher said the evidence shown on air was conclusive and proved the ball had gone out of play. \"It goes out of play, there is no doubt about that,\" he said onSuper Sunday.\nBut former Villa man Ashley Young disagreed, claiming the benefit of the doubt should have gone to the attacking side given the lack of clear evidence.\nPlease use Chrome browser for a more accessible video player\n\nHe added: \"I think you can say it goes out but categorically are they saying they can see that? No, they can't.\n\"It should go in favour of the forward.\"\nPlease use Chrome browser for a more accessible video player\n\nSpeaking in the 2023/24 season, when Newcastle's Anthony Gordon had a goal given against Arsenal after a similar incident, Gary Neville dissected how a ball can appear to be out but actually remain in play.\nPositioning it near the touchline, Neville demonstrated how one angle can show the ball touching the line and another, which would be used by VAR, could appear to show it out of play.\n\"That ball is in. The edge of the ball is touching the edge of the white line.\n\"When you see that from here, you think it is not a debate. When you cut to the different angles that the VAR had to look at [it changes].\n\"We are not trying to say the ball is in or the ball is out, we are trying to say VAR cannot make a decision to overturn the on-field decision.\n\"There is ambiguity; it is an optical illusion.\"\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11661/13502338/tammy-abrahams-disallowed-equaliser-new-brentford-footage-shows-ball-did-go-out-of-play-against-aston-villa",
        "scraped_at": "2026-02-03T19:21:34.325340"
    },
    {
        "title": "January transfer window: Your club's business assessed, including Man Utd, Liverpool and Arsenal",
        "content": "Football\nThe winter transfer window is closed and more than £400m was spent on signings by Premier League teams - but how did your club do in the market? Sky Sports analyses every side's business in this window...\nTuesday 3 February 2026 08:47, UK\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterDharmesh Sheth:\nGoing into the window, the feeling was Arsenal were going to be quiet. And so it proved.\nThey did their business in the summer - and were only likely to dip into the market if a long-term target or unique market opportunity presented itself.\nManager Mikel Arteta maintained they would be alive and alert.\nHowever, he also called for the numbers in a matchday squad to be increased in line with Europe. He is begging for 23 in total - and 20 outfield players. The reason? He is having to disappoint two or three players every game.\nWith that in mind, the chance of a new signing was always going to be slim.\nTransfer Centre LIVE on your phone!\nPapers - latest headlines\nGet Sky Sports\nDownload the Sky Sports App\nA serious injury to Mikel Merino gave Arsenal food for thought- and they tentatively explored a potential deal. However, that's as far as it got and Arsenal will continue their fight on all four fronts with the squad they have.\nThoughts will no doubt switch to the summer when Arsenal are expected to be busy again.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterRob Jones:\nWith the challenges presented by complying with the Premier League and UEFA's financial rules still very pertinent for Aston Villa they perhaps did as much as they could this January to remain competitive on three fronts in the coming months.\nDouglas Luiz has a lot of work to do to cover for the absence of injured trio John McGinn, Boubacar Kamara and Youri Tielemans for the foreseeable future, but at least he knows Unai Emery's system.\nTammy Abraham knows the club and is a more natural central striker than Donyel Malen, who left to join Roma. Returning from Rome is Leon Bailey who feels a better option than Evan Guessand, who underwhelmed after his summer arrival.\nEmery's brilliance probably holds the key to Villa holding off the challenge from behind in the league and ending a 30-year wait for silverware.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterMark McAdam:\nThis was always going to be a tough transfer window for Bournemouth to navigate with the anticipated departure of Antoine Semenyo due to his release clause. However, with the arrival of four new faces for Andoni Iraola, this window will be seen as a success.\nThe injury to Justin Kluivert around the same time as Semenyo left for Man City only added to the sense that this would be a pivotal period for the Cherries. Results were mixed and the club were flirting with slipping into the relegation battle. It all felt a bit worrying.\nHow different the picture looks now though. Unbeaten in five games and 13 points clear of the bottom three, Bournemouth can comfortably look up the table rather than over their shoulder and the early signs are that their latest recruits could be hits.\nBrazilian teenager Rayan, the potential Semenyo replacement, set up Bournemouth's second goal in Saturday's 2-0 win at Wolves in his debut following £30.3m move from Vasco da Gama. Bournemouth will be glad he has a release clause of £86.3m in his contract.\nThe signing of midfielder Alex Toth from Ferencvaros was another coup. Lazio, Benfica and Galatasary were all chasing the 20-year-old, who was developed at the Hungarian club by head coach Robbie Keane, and he comes with experience of pressure environments.\nBournemouth have also brought in goalkeeper Christos Mandas from Lazio to provide competition for Djordje Petrovic in a move that could become permanent in the summer. Left back Ade Solanke, 18, is seen as one for the future after signing from Lorient.\nThere was hope at one point of adding a fifth signing. Inter's Luis Henrique was one of those that Bournemouth looked at but because of the club being in such a comfortable position there was no desire to force a move at an inflated price late in the window.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News senior football news editorLyall Thomas:\nBrentford's impressive form this season meant they could stay measured in this window. Their league position is a reflection of the great work they have done in previous windows.\nThey had wanted to add a young centre-forward prospect for some time and Kaye Furo becomes that player, now learning under former Club Brugge team-mate Igor Thiago.\nThey also kept hold of some key players in Kristoffer Ajer and Vitaly Janelt. Both have signed new deals after uncertainty around their futures and interest from other clubs.\nThere may have been some further changes in defence but nothing really materalised for Ethan Pinnock in the end, meaning no replacement was needed.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News news editorElliot Cook:\nIt started with a bang but arguably ended with a bit of a whimper.\nBrighton's window started in spectacular fashion with the return of club legend Pascal Gross early on. The re-signing of the Germany international for a fee of £1.2m from Borussia Dortmund is already starting to pay dividends. His experience will be key and is sure to rub off on the many young players in the squad.\nMatt O'Riley is another player to return to the club albeit in different circumstances. The midfielder's loan from Marseille was ended early and becomes another option for head coach Fabian Hurzeler. With appearances in the Champions League for the French club this season, the former Celtic man comes back a better player.\nThe 25-year-old's return to Brighton was confirmed on the final day of the window. Perhaps there was a hope amongst some of the support in certain quarters that there would be more arrivals.\nShould a striker have come in to ease the pressure on 35-year-old Danny Welbeck and 18-year-old Charalampos Kostoulas up front? Evan Ferguson's possible return from a loan spell at Roma was often a topic of discussion but he is staying in Italy.\nHas Tommy Watson's loan move to Millwall for the rest of the season left Brighton light in terms of back-up wingers? Brajan Gruda has moved to Leipzig on loan too.\nBrighton tend not to do too much business in January - they are calm, not reactive and spend much of it looking at forward planning. Much work would have been done behind the scenes for the summer window. Expect a fair bit of movement in and out then.\nWorth a reminder that one of their best signings this window might not be a player but one behind the scenes. Mike Anthony, who was high performance chief at the All Blacks, came in to take a newly created role as the club's head of player development and high performance in what they feel is an innovative move focused on culture and mentality.\nSky Sports News digital journalistDeclan Olley:\nThis was always going to be a tough window for Burnley to do business in given their current position in the Premier League table.\nSigning James Ward-Prowse, a player with a proven track record in the Premier League, from a relegation rival no less, will certainly be seen as a smart signing by Scott Parker.\nWhether that will be enough to surmount the overwhelming challenge Burnley face in terms of keeping themselves in the Premier League remains to be seen.\nAt one stage, it looked as if Ward-Prowse's move from West Ham would not happen. At least they managed to get this one over the line.\nWhatever Burnley did in this window, they were always facing an unenviable task to stay in the Premier League.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News chief correspondentKaveh Solhekol:\nChelsea are usually big spenders in transfer windows but this turned out to be a quiet month by Stamford Bridge standards.\nThey missed out on their No. 1 target Jeremy Jacquet. Liverpool got him at the last minute after Chelsea were confident that he would choose them ahead of other interested clubs.\nIt's debatable whether Chelsea needed another centre back, especially with Levi Colwill due back from injury before the end of the season and promising young defenders out on loan.\nOne of them - Mamadou Sarr - is coming back from sister club Strasbourg and he is expected to challenge for a first-team place straightaway.\nThis window officially marked the end of Chelsea's so-called Bomb Squad. Raheem Sterling's contract was terminated and Axel Disasi joined West Ham on loan.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterJames Savundra:\nIt's been some start to the year for Crystal Palace.\nThey smashed their transfer record to sign Brennan Johnson from Spurs. Their FA Cup defence collapsed at the first attempt against non-League Macclesfield Town. Days later, their manager Oliver Glasner confirmed he'd be heading off in the summer just moments after revealing that club captain Marc Guehi was set to be sold.\nOn the pitch, the winless run continued as a season filled with promise began to unravel. Reinforcements were forthcoming as the future of their top scorer Jean-Philippe Mateta became more and more uncertain. Long-term target Evann Guessand was signed in a try-before-you-buy loan deal from Aston Villa as Palace threatened to commit more than £100m in incomings in the winter window.\nAs ever, all roads pointed towards a busy Deadline Day. Jorgen Strand Larsen was lined up as a replacement for Mateta. But the wantaway Frenchmen didn't get the Italian Job done.\nIt seemed implausible that Palace would end the season with two frontline strikers but they deserve credit for ploughing ahead with the deal for Strand Larsen despite the late collapse of Mateta's move to Milan.\nIt's a calculated gamble from Steve Parish. They have added firepower up front. They have failed to replace their captain but left no stone unturned in their attempt to sign a central defender for a fair market price.\nIt's now imperative Palace immediately quell any doubts surrounding their Premier League status and then press forward in achieving a successful finish. A rollercoaster season could still culminate in European glory.\nSky Sports News reporterVinny O'Connor:\nDavid Moyes had been pretty clear in his expectations that this window and Deadline Day was not going to be spectacular.\nOnly a few weeks ago he said to me how welcome an approach it is given the spending of the past which caused Everton so much harm in the long run.\nSo, a quiet window ended with what should be seen as sensible business.\nIn Tyrique George they are getting the chance to have a look at a 19 year old who joins on loan until the end of the season, before deciding whether or not to take up their option to buy.\nThere was interest in George from another premier league club and one in Europe, who was close to a £22m move to Fulham in the summer. And he arrives at Everton having scored three goals in 11 Chelsea appearances this season, including in the Champions League at home to Ajax.\nIn total he's made 37 appearances for Chelsea including one Premier league start. While his only Premier League goal came last season as he kick started the comeback win at Fulham.\nGiven the injury to Jack Grealish, George will be hopeful David Moyes can offer him greater playing time.\nThe Everton boss will have also Dwight McNeil to call on for the remainder of the season out wide after his move to Crystal Palace collpased after the deadline had passed. A deal sheet was submitted but the relevant paperwork was not done in time.\nAt the obligation price of £20m it was a difficult offer for Everton to say no to. But having another more experienced wide player to support youngsters George and Tyler Dibling could prove valuable for Moyes.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterJames Cole:\nDeadline Day at Fulham started with a great deal of promise but ultimately failed to deliver. The club were hopeful they could get a deal done for Riccardo Pepi, the PSV Eindhoven striker.\nThe club had reached an agreement on a £32m package, but that was on the proviso that PSV could find a replacement. They were unable to do so and therefore the deal fell through.\nFulham do however still hope to pick it back up in the summer. The 21-year-old Pepi is a long-term target and a long-term successor to Raul Jimenez.\nHarry Wilson was also in the headlines early on Deadline Day. It emerged Everton had made an approach for him last week - unsurprisingly it was rejected by Fulham. Marco Silva has repeatedly said Wilson is going nowhere in this window.\nSo, Fulham's January business saw a 30-year-old winger, Adame Traore, leave the club and a 22-year-old winger, Oscar Bobb, arrive.\nSlim business, yes - but if Bobb can stay fit and fulfill his potential you have to say potentially very good business too.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News digital journalistZinny Boswell:\nLeeds United reach the end of another transfer window with an overwhelming sense of what could have been after missing out on Jorgen Strand Larsen to Crystal Palace.\nThis was never supposed to be a big window for Daniel Farke's side and loan signings were always thought to be more likely than permanent deals. That is how things panned out in the end with Facundo Buonanotte, a loan from Brighton, the only incoming for Leeds.\nThe Argentina international playmaker adds a creative profile to the squad that was lacking, but it remains to be seen if he can cut it at Premier League level after struggling to consistently keep his place in the team at Brighton and Leicester.\nExpectations were low coming into the window, but the pursuit of Strand Larsen raised hopes. Leeds were unwilling to go above £40m - Wolves' initial valuation for the striker - and Palace ended up committing to £8m more than that.\nFor a club that said they were maxing out PSR after the summer, there was no further that Leeds could stretch to make this deal happen. So why did some of those funds not go towards improving other areas of the squad?\nLeeds were planning to structure most of the deal to come out of next year's budget to stay within Premier League rules. Strand Larsen was also viewed as a unique opportunity and players like that do not often become available in mid-season windows.\nAt a time when there is uncertainty in the goalkeeping department and injuries at full-back, it has been received by some fans as a gamble not to invest more in the squad to give Leeds the best chance of Premier League survival.\nWe have been here before, though, with Leeds. In the summer, deals for the likes of Igor Paixao failed to materialise, and there were concerns that this squad did not have what it takes to cope with the Premier League. So far, they have defied those expectations.\nThe true test will be in May. If Leeds stay up, none of this matters, but if they go down then perhaps the club will look back on this window as a missed opportunity to strengthen. Only time will tell.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterVinny O'Connor:\nAfter a record breaking spend in the summer, this was a window in which Liverpool were never going to go wild. At the same time, having missed out on Marc Guehi on the final day of the summer window when Crystal Palace pulled the plug, to then lose him to Manchester City was a major blow.\nUltimately the whole package didn't make financial sense, which was disappointing given how open to the move Guehi had been in the summer and the fact that Liverpool's interest had never waned, particularly as they saw him as someone who is not only one of the Premier League's centre backs but can also cover at right back.\nLiverpool's need for defensive reinforcements was emphasised by injuries to Joe Gomez, Jeremie Frimpong and Conor Bradley all adding to the long term absence of Geovanni Leoni.\nUltimately, a deal for Lutsharel Geertruida proved impossible as Sunderland were not in a position to sanction the move despite the player himself wanting to make the switch.\nIt all meant that discussions with Spurs over a £5m move for Andy Robertson were short-lived as it would have made little sense for Liverpool to weaken their defensive options further. Similarly, Inter Milan's interest in Curtis Jones was swiftly rebuffed.\nLiverpool, though, have started the reshaping of their backline. Jeremy Jacquet completed a medical before finalising a deal that could see Liverpool pay Rennes up to £60m for the 20-year-old centre half. However, he will only become a Liverpool player in the summer, and will play out the rest of the season with Rennes hoping to deliver European football.\nUnlike the Guehi situation, Liverpool have headed off interest from other clubs, most notably Chelsea, with Jacquet believing he'll get more game time at Anfield. For the rest of this season though, it's a case of as you were when it comes to the makeup of this current Liverpool squad.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News senior football news editorLyall Thomas:\nManchester City arguably stole the show this window by swooping in ahead of Liverpool and other top clubs for Antione Semenyo and Marc Guehi.\nThey have made two important additions ahead of the summer in key positions and signed Premier League ready players who have already hit the ground running.\nA solution has also been found, finally, for Kalvin Phillips who joins Sheffield United on loan until the summer.\nSverre Nypan returns from a loan at Middlesbrough to integrate into the first-team, while a number of other youngsters head out on loan for more game time.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterDanyal Khan:\nAs expected, it was overall a quiet window in the January transfer window for Manchester United.\nEntering the window, there was uncertainty amongst a few players such as the likes of Kobbie Mainoo, Manuel Ugarte and Joshua Zirkzee.\nBut none of those situations for different reasons ended up in departures - and perhaps the reason why is because the biggest outgoing of the window for the club was United's former head coach Ruben Amorim and the most impactful incoming was his replacement Michael Carrick after leading them to three huge wins in the last three weeks.\nThe change has seen United start Kobbie Mainoo start and star three league games in a row which has put questions around his future on hold for now.\nHowever with no reinforcements, all attention for United will be on the summer window as they look to reshape their midfield, especially with Casemiro leaving the club at the end of his contract this summer as well.\nThey resisted the temptation to reinforce this window and refused to compromise on their long-term targets but all eyes will be on United's hierarchy this summer - especially when it is still uncertain who will be the head coach going into next season.\nFollow Sky Sports on WhatsApp for the latest sports news, videos, features, analysis and much more\nSky Sports News reporterKeith Downie:\nNewcastle failed to make a January signing, much to the frustration of their fanbase.\nWith a relentless fixture schedule that sees them currently play a game every three days, a fresh face would have given everyone a lift. Eddie Howe has previously gone on record to say he'd like to sign at least one new player every window.\nIn truth though, Newcastle are still counting the cost of a summer splurge that saw them spend £250m. The jury is still out on a few of those new faces as Eddie Howe attempts to knit a new team together without the player they were all there to serve - Alexander Isak. It all feels very much a work in progress.\nThe biggest move of Deadline Day was club captain Jamaal Lascelles moving to Leicester City after 12 long years with the club.\nThe team as a whole are doing okay despite the distractions and residual damage of last summer, and are still in four competitions.\nBut when it comes to new faces they'll keep their powder dry until the summer as they look to strengthen significantly then.\nIt won't all go their way, as it again looks as though they'll have to brace themselves for further attempts from competitors to sign their best players. Sandro Tonali and Tino Livramento are two that continually get linked with moves away.\nBut for now, it's batten down the hatches and get through until the end of the season.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterAnton Toloui:\nNottingham Forest had a frustrating end to the window but covered most positions they wanted filling.\nThere will be lots of focus on their failed bids for Arne Engels and Jean-Phillippe Mateta but both would have been bonus signings.\nLuca Netz was brought in for a pittance by Premier League standards to offer competition at left-back, Lorenzo Lucca offers another striking threat with Chris Wood out and Stefan Ortega's arrival was timely after an injury to 'keeper Matz Sels.\nLong-term targets will be chased in the summer but Elliot Anderson's future will be the main story at the City Ground at the end of the season.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterKeith Downie:\nIt was a significantly quieter transfer window for Sunderland than what we saw in the summer when 14 new arrivals cost around £150m.\nThat was a necessity back then, but the need for mass change has been reduced due to Sunderland's impressive start to the season that sees them unbeaten at home and lying mid-table.\nThe one big signing arrived on Deadline Day - Nilson Angulo from Anderlecht. The winger has signed for £15m, with a potential £2.5m in addition in add-ons.\nIt was left very late, and reliant on outcast Adil Aouchiche freeing up a loan spot by cutting his deal at Aberdeen short and moving to Schalke. That loan spot was the taken by Simon Adingra who joined Monaco on loan, and allowed Sunderland to sign Angulo permanently.\nConfused? It's never dull on Deadline Day. Sporting director Florent Ghisolfi can be very creative.\nLiverpool tried to make it more confusing by attempting to sign Lutsharel Geertruida over the weekend. But due to the complexity of the deal (The Dutchman is on a season-long loan from RB Leipzig) Sunderland refused to sanction it.\nThere were a number of January departures from The Stadium of Light. The most notable one being former captain Dan Neil, who led the club promotion to the Premier League. He was never given a chance by Regis Le Bris in the top flight, but now has the chance for back-to-back promotions with Ipswich\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterMichael Bridge:\nTottenham end the window with Thomas Frank's squad looking short amid an injury crisis despite the arrivals of midfielder Conor Gallagher and left-back Souza. Failure to bring in a forward after injuries to Richarlison and Mohammed Kudus is the big shortcoming for Spurs.\nThe club did not want to be reactive to their situation and panic buy. January is a notoriously hard window to do business in and top players rarely become available. Every effort was put into trying to sign Antoine Semenyo, but he chose to join Manchester City.\nSpurs also tried to sign Andy Robertson to inject some much-needed experience into the side and provide cover for the injured Ben Davies. However, it proved too difficult for Liverpool to recall Kostas Tsimikas from his loan at Roma and the deal could not be done.\nRandal Kolo Muani, Mathys Tel, Radu Dragusin and Antonin Kinsky all attracted interest in this window but Spurs could not sanction their exits with all their injury issues. They have all struggled for game time this season but there is an opportunity now to prove themselves.\nSpurs have big plans to strengthen in the summer transfer window. Frank will hope he gets the time to reap the benefits of that. The spirited fight-back in the draw against Man City suggests he has the backing of the players, but a lot is being asked of this depleted group.\nFrank and his employers must hope that they have enough to rise to the occasion and restore some consistency for Spurs. Otherwise, the increasingly frustrated fanbase may run out of patience with the lack of support they have been given.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News reporterChris Reidy:\nWest Ham made a fast start to the transfer window and a slow-ish end.\nTaty Castellanos and Pablo coming in within five days of January strengthened the attack. Adama Traore coming in towards the end adds pace and unpredictability into the squad.\nNuno Espírito Santo constantly talked about rebalancing the squad during the winter window. I can't quite work out if he has so I'll be interested to get his answer when I speak to him on Thursday. Apart from Lucas Paqueta, no key players have left. And the Lucas Paqueta we've seen this season can't be described as key.\nPlayers who weren't playing minutes are gone. Igor Julio, James Ward-Prowse, Guido Rodriguez and Andy Irving are out. Axel Disasi signing on the final day offers needed cover.\nAre West Ham stronger now than compared to the start of the window? I would say just. Pablo and Castellanos as a pair seems to be working up front but if that starts to slow down, the window starts to look very different.\nPlease use Chrome browser for a more accessible video player\n\nSky Sports News senior football news editorLyall Thomas:\nWolves' window has been more about outgoings than incomings, as the club looks increasingly likely to be relegated at the end of the season.\nThey have sold arguably their best forward in Jorgen Strand Larsen to Crystal Palace for £48m, which has to be seen as trying to extract maximum value for a player out of form.\nIn turn the club have been looking to get ready for a medium term that may involve a season at least in the Championship, and the additions of Adam Armstrong and Angel Gomes add know-how and quality.\nIt is a shame they did not also add Che Adams - a long-term target - to their thanks despite trying with Torino right until the final day.\nTough times ahead for Wolves indeed but the money from Strand Larsen gives them more to spend in the summer and with time to plan for the market.\nPlay Super 6 for a chance to win £200k! Enter for free.\n© 2026 Sky UK",
        "url": "https://www.skysports.com/football/news/11661/13502284/january-transfer-window-your-clubs-business-assessed-including-man-utd-liverpool-and-arsenal",
        "scraped_at": "2026-02-03T19:21:35.144201"
    }
]